// Auto-generated historical Hakone qualifier database
window.hakoneQualifierDB = {
  "generatedAt": "2026-09-06T18:44:43.551Z",
  "years": {
    "2022": {
      "year": 2022,
      "eventYear": 2022,
      "hakoneEdition": 99,
      "teams": [
        {
          "rank": 1,
          "time": "10:40:39",
          "team": "大東文化大学"
        },
        {
          "rank": 2,
          "time": "10:41:41",
          "team": "明治大学"
        },
        {
          "rank": 3,
          "time": "10:42:09",
          "team": "城西大学"
        },
        {
          "rank": 4,
          "time": "10:42:29",
          "team": "早稲田大学"
        },
        {
          "rank": 5,
          "time": "10:43:34",
          "team": "日本体育大学"
        },
        {
          "rank": 6,
          "time": "10:46:18",
          "team": "立教大学"
        },
        {
          "rank": 7,
          "time": "10:46:55",
          "team": "山梨学院大学"
        },
        {
          "rank": 8,
          "time": "10:46:56",
          "team": "専修大学"
        },
        {
          "rank": 9,
          "time": "10:47:03",
          "team": "東海大学"
        },
        {
          "rank": 10,
          "time": "10:48:55",
          "team": "国士舘大学"
        },
        {
          "rank": 11,
          "time": "10:49:29",
          "team": "神奈川大学"
        },
        {
          "rank": 12,
          "time": "10:51:25",
          "team": "中央学院大学"
        },
        {
          "rank": 13,
          "time": "10:52:02",
          "team": "日本大学"
        },
        {
          "rank": 14,
          "time": "10:52:40",
          "team": "麗澤大学"
        },
        {
          "rank": 15,
          "time": "10:53:50",
          "team": "筑波大学"
        },
        {
          "rank": 16,
          "time": "10:55:00",
          "team": "日本薬科大学"
        },
        {
          "rank": 17,
          "time": "10:55:01",
          "team": "東京農業大学"
        },
        {
          "rank": 18,
          "time": "10:55:44",
          "team": "拓殖大学"
        },
        {
          "rank": 19,
          "time": "10:56:07",
          "team": "駿河台大学"
        },
        {
          "rank": 20,
          "time": "10:59:27",
          "team": "芝浦工業大学"
        },
        {
          "rank": 21,
          "time": "11:02:29",
          "team": "上武大学"
        },
        {
          "rank": 22,
          "time": "11:02:49",
          "team": "明治学院大学"
        },
        {
          "rank": 23,
          "time": "11:03:36",
          "team": "育英大学"
        },
        {
          "rank": 24,
          "time": "11:04:06",
          "team": "亜細亜大学"
        },
        {
          "rank": 25,
          "time": "11:06:30",
          "team": "関東学院大学"
        },
        {
          "rank": 26,
          "time": "11:07:02",
          "team": "慶應義塾大学"
        },
        {
          "rank": 27,
          "time": "11:08:23",
          "team": "桜美林大学"
        },
        {
          "rank": 28,
          "time": "11:08:49",
          "team": "東京経済大学"
        },
        {
          "rank": 29,
          "time": "11:12:53",
          "team": "平成国際大学"
        },
        {
          "rank": 30,
          "time": "11:15:58",
          "team": "流通経済大学"
        },
        {
          "rank": 31,
          "time": "11:18:18",
          "team": "立正大学"
        },
        {
          "rank": 32,
          "time": "11:24:54",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 33,
          "time": "11:31:47",
          "team": "湘南工科大学"
        },
        {
          "rank": 34,
          "time": "11:35:18",
          "team": "東京大学大学院"
        },
        {
          "rank": 35,
          "time": "11:50:04",
          "team": "東京大学"
        },
        {
          "rank": 36,
          "time": "11:58:36",
          "team": "清和大学"
        },
        {
          "rank": 37,
          "time": "12:04:04",
          "team": "東京工業大学"
        },
        {
          "rank": 38,
          "time": "12:08:14",
          "team": "帝京平成大学"
        },
        {
          "rank": 39,
          "time": "12:35:36",
          "team": "東京理科大学"
        },
        {
          "rank": 40,
          "time": "12:38:08",
          "team": "高崎経済大学"
        },
        {
          "rank": 41,
          "time": "12:41:49",
          "team": "成蹊大学"
        }
      ],
      "individuals": [
        {
          "rank": 1,
          "time": "1:00:58",
          "name": "ワンジク・チャールズカマウ",
          "grade": "3",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 2,
          "time": "1:01:50",
          "name": "ジョセフ・ラジニ",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 3,
          "time": "1:02:03",
          "name": "ネルソン・マンデラ・ンビディ",
          "grade": "1",
          "team": "桜美林大学"
        },
        {
          "rank": 4,
          "time": "1:02:15",
          "name": "ジェームス・ムトゥク",
          "grade": "1",
          "team": "山梨学院大学"
        },
        {
          "rank": 5,
          "time": "1:02:16",
          "name": "ピーター・ワンジル",
          "grade": "2",
          "team": "大東文化大学"
        },
        {
          "rank": 6,
          "time": "1:02:21",
          "name": "ヴィクター・キムタイ",
          "grade": "1",
          "team": "城西大学"
        },
        {
          "rank": 7,
          "time": "1:02:29",
          "name": "ノア・キプリモ",
          "grade": "4",
          "team": "日本薬科大学"
        },
        {
          "rank": 8,
          "time": "1:02:32",
          "name": "木村 暁仁",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 9,
          "time": "1:02:39",
          "name": "井川 龍人",
          "grade": "4",
          "team": "早稲田大学"
        },
        {
          "rank": 10,
          "time": "1:02:39",
          "name": "富田 峻平",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 11,
          "time": "1:02:43",
          "name": "児玉 真輝",
          "grade": "3",
          "team": "明治大学"
        },
        {
          "rank": 12,
          "time": "1:02:46",
          "name": "高槻 芳照",
          "grade": "3",
          "team": "東京農業大学"
        },
        {
          "rank": 13,
          "time": "1:02:48",
          "name": "鈴木 康也",
          "grade": "2",
          "team": "麗澤大学"
        },
        {
          "rank": 14,
          "time": "1:03:04",
          "name": "有村 祐亮",
          "grade": "4",
          "team": "神奈川大学"
        },
        {
          "rank": 15,
          "time": "1:03:05",
          "name": "福谷 颯太",
          "grade": "4",
          "team": "筑波大学"
        },
        {
          "rank": 16,
          "time": "1:03:05",
          "name": "佐藤 航希",
          "grade": "3",
          "team": "早稲田大学"
        },
        {
          "rank": 17,
          "time": "1:03:07",
          "name": "鈴木 創士",
          "grade": "4",
          "team": "早稲田大学"
        },
        {
          "rank": 18,
          "time": "1:03:07",
          "name": "北村 惇生",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 19,
          "time": "1:03:09",
          "name": "チャールズ・ド゙ゥング",
          "grade": "4",
          "team": "日本大学"
        },
        {
          "rank": 20,
          "time": "1:03:12",
          "name": "大野 陽人",
          "grade": "4",
          "team": "大東文化大学"
        },
        {
          "rank": 21,
          "time": "1:03:13",
          "name": "國安 広人",
          "grade": "1",
          "team": "立教大学"
        },
        {
          "rank": 22,
          "time": "1:03:14",
          "name": "ピーター・カマウ",
          "grade": "2",
          "team": "国士舘大学"
        },
        {
          "rank": 23,
          "time": "1:03:14",
          "name": "ダンカン・キサイサ",
          "grade": "2",
          "team": "専修大学"
        },
        {
          "rank": 24,
          "time": "1:03:15",
          "name": "久保田 徹",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 25,
          "time": "1:03:15",
          "name": "デイビッド・シュンゲヤ・ネイヤイ",
          "grade": "1",
          "team": "麗澤大学"
        },
        {
          "rank": 26,
          "time": "1:03:18",
          "name": "吉田 響",
          "grade": "2",
          "team": "東海大学"
        },
        {
          "rank": 27,
          "time": "1:03:18",
          "name": "斎藤 将也",
          "grade": "1",
          "team": "城西大学"
        },
        {
          "rank": 28,
          "time": "1:03:21",
          "name": "盛本 聖也",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 29,
          "time": "1:03:22",
          "name": "ステフィン・カマウ",
          "grade": "4",
          "team": "平成国際大学"
        },
        {
          "rank": 30,
          "time": "1:03:25",
          "name": "田島 公太郎",
          "grade": "2",
          "team": "慶應義塾大学"
        },
        {
          "rank": 31,
          "time": "1:03:27",
          "name": "カマウ・パトリック",
          "grade": "1",
          "team": "上武大学"
        },
        {
          "rank": 32,
          "time": "1:03:27",
          "name": "菊地 駿介",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 33,
          "time": "1:03:28",
          "name": "新田 颯",
          "grade": "4",
          "team": "育英大学"
        },
        {
          "rank": 34,
          "time": "1:03:32",
          "name": "長谷川 瑠",
          "grade": "2",
          "team": "流通経済大学"
        },
        {
          "rank": 35,
          "time": "1:03:33",
          "name": "中山 雄太",
          "grade": "4",
          "team": "日本薬科大学"
        },
        {
          "rank": 36,
          "time": "1:03:37",
          "name": "橋本 章央",
          "grade": "3",
          "team": "芝浦工業大学"
        },
        {
          "rank": 37,
          "time": "1:03:47",
          "name": "工藤 大和",
          "grade": "4",
          "team": "麗澤大学"
        },
        {
          "rank": 38,
          "time": "1:03:48",
          "name": "清野 太成",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 39,
          "time": "1:03:49",
          "name": "伊藤 大志",
          "grade": "2",
          "team": "早稲田大学"
        },
        {
          "rank": 40,
          "time": "1:03:52",
          "name": "若山 岳",
          "grade": "4",
          "team": "日本大学"
        },
        {
          "rank": 41,
          "time": "1:03:53",
          "name": "木山 達哉",
          "grade": "4",
          "team": "山梨学院大学"
        },
        {
          "rank": 42,
          "time": "1:03:53",
          "name": "廣澤 優斗",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 43,
          "time": "1:03:53",
          "name": "入濵 輝大",
          "grade": "1",
          "team": "大東文化大学"
        },
        {
          "rank": 44,
          "time": "1:03:54",
          "name": "山田 拓人",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 45,
          "time": "1:03:54",
          "name": "中山 凜斗",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 46,
          "time": "1:03:56",
          "name": "宇津野 篤",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 47,
          "time": "1:03:57",
          "name": "石原 翔太郎",
          "grade": "3",
          "team": "東海大学"
        },
        {
          "rank": 48,
          "time": "1:04:00",
          "name": "町田 康誠",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 49,
          "time": "1:04:01",
          "name": "松崎 咲人",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 50,
          "time": "1:04:02",
          "name": "村上 航大",
          "grade": "4",
          "team": "上武大学"
        }
      ],
      "source": "https://genkimanman.com/halfmarathon/hakoneyosen/hakoneyosen2022.html"
    },
    "2023": {
      "year": 2023,
      "eventYear": 2023,
      "hakoneEdition": 100,
      "teams": [
        {
          "rank": 1,
          "time": "10:33:39",
          "team": "大東文化大学"
        },
        {
          "rank": 2,
          "time": "10:34:38",
          "team": "明治大学"
        },
        {
          "rank": 3,
          "time": "10:35:08",
          "team": "帝京大学"
        },
        {
          "rank": 4,
          "time": "10:36:42",
          "team": "日本体育大学"
        },
        {
          "rank": 5,
          "time": "10:36:54",
          "team": "日本大学"
        },
        {
          "rank": 6,
          "time": "10:37:06",
          "team": "立教大学"
        },
        {
          "rank": 7,
          "time": "10:37:20",
          "team": "神奈川大学"
        },
        {
          "rank": 8,
          "time": "10:37:21",
          "team": "国士舘大学"
        },
        {
          "rank": 9,
          "time": "10:37:27",
          "team": "中央学院大学"
        },
        {
          "rank": 10,
          "time": "10:37:58",
          "team": "東海大学"
        },
        {
          "rank": 11,
          "time": "10:39:05",
          "team": "東京農業大学"
        },
        {
          "rank": 12,
          "time": "10:39:40",
          "team": "駿河台大学"
        },
        {
          "rank": 13,
          "time": "10:39:47",
          "team": "山梨学院大学"
        },
        {
          "rank": 14,
          "time": "10:39:50",
          "team": "東京国際大学"
        },
        {
          "rank": 15,
          "time": "10:43:15",
          "team": "麗沢大学"
        },
        {
          "rank": 16,
          "time": "10:43:16",
          "team": "拓殖大学"
        },
        {
          "rank": 17,
          "time": "10:44:41",
          "team": "上武大学"
        },
        {
          "rank": 18,
          "time": "10:44:51",
          "team": "専修大学"
        },
        {
          "rank": 19,
          "time": "10:48:34",
          "team": "日本薬科大学"
        },
        {
          "rank": 20,
          "time": "10:49:07",
          "team": "筑波大学"
        },
        {
          "rank": 21,
          "time": "10:49:18",
          "team": "平成国際大学"
        },
        {
          "rank": 22,
          "time": "10:49:20",
          "team": "慶応義塾大学"
        },
        {
          "rank": 23,
          "time": "10:50:14",
          "team": "芝浦工業大学"
        },
        {
          "rank": 24,
          "time": "10:51:41",
          "team": "明治学院大学"
        },
        {
          "rank": 25,
          "time": "10:52:37",
          "team": "亜細亜大学"
        },
        {
          "rank": 26,
          "time": "10:53:27",
          "team": "桜美林大学"
        },
        {
          "rank": 27,
          "time": "10:54:22",
          "team": "京都産業大学"
        },
        {
          "rank": 28,
          "time": "10:55:02",
          "team": "流通経済大学"
        },
        {
          "rank": 29,
          "time": "10:55:55",
          "team": "東京経済大学"
        },
        {
          "rank": 30,
          "time": "10:58:41",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 31,
          "time": "11:01:18",
          "team": "関東学院大学"
        },
        {
          "rank": 32,
          "time": "11:01:54",
          "team": "立正大学"
        },
        {
          "rank": 33,
          "time": "11:02:24",
          "team": "育英大学"
        },
        {
          "rank": 34,
          "time": "11:05:23",
          "team": "立命館大学"
        },
        {
          "rank": 35,
          "time": "11:10:00",
          "team": "皇学館大学"
        },
        {
          "rank": 36,
          "time": "11:15:34",
          "team": "湘南工科大学"
        },
        {
          "rank": 37,
          "time": "11:20:26",
          "team": "札幌学院大学"
        },
        {
          "rank": 38,
          "time": "11:25:40",
          "team": "東京大学"
        },
        {
          "rank": 39,
          "time": "11:26:01",
          "team": "日本文理大学"
        },
        {
          "rank": 40,
          "time": "11:29:39",
          "team": "国際武道大学"
        },
        {
          "rank": 41,
          "time": "11:31:26",
          "team": "東京大学大学院"
        },
        {
          "rank": 42,
          "time": "11:33:24",
          "team": "清和大学"
        },
        {
          "rank": 43,
          "time": "11:33:43",
          "team": "大阪経済大学"
        },
        {
          "rank": 44,
          "time": "11:35:05",
          "team": "中京大学"
        },
        {
          "rank": 45,
          "time": "11:41:25",
          "team": "環太平洋大学"
        },
        {
          "rank": 46,
          "time": "11:43:30",
          "team": "愛知工業大学"
        },
        {
          "rank": 47,
          "time": "11:53:05",
          "team": "信州大学"
        },
        {
          "rank": 48,
          "time": "11:57:31",
          "team": "東京工業大学大学院"
        },
        {
          "rank": 49,
          "time": "12:03:59",
          "team": "東京理科大学"
        },
        {
          "rank": 50,
          "time": "12:14:28",
          "team": "一橋大学"
        },
        {
          "rank": 51,
          "time": "12:14:57",
          "team": "防衛大学校"
        },
        {
          "rank": 52,
          "time": "12:19:19",
          "team": "埼玉大学"
        },
        {
          "rank": 53,
          "time": "12:24:09",
          "team": "千葉大学"
        },
        {
          "rank": 54,
          "time": "12:25:09",
          "team": "成蹊大学"
        },
        {
          "rank": 55,
          "time": "12:28:57",
          "team": "放送大学関西"
        },
        {
          "rank": 56,
          "time": "12:48:48",
          "team": "群馬大学"
        }
      ],
      "individuals": [
        {
          "rank": 1,
          "time": "1:00:16",
          "name": "シャドラック キップケメイ",
          "grade": "1",
          "team": "日本大学"
        },
        {
          "rank": 2,
          "time": "1:00:17",
          "name": "デニス キプルト",
          "grade": "1",
          "team": "日本薬科大学"
        },
        {
          "rank": 3,
          "time": "1:00:46",
          "name": "ジェームス ムトゥク",
          "grade": "2",
          "team": "山梨学院大学"
        },
        {
          "rank": 4,
          "time": "1:01:19",
          "name": "ワンジク チャールズカマウ",
          "grade": "4",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 5,
          "time": "1:01:31",
          "name": "カマウ パトリック",
          "grade": "2",
          "team": "上武大学"
        },
        {
          "rank": 6,
          "time": "1:01:31",
          "name": "ピーター カマウ",
          "grade": "3",
          "team": "国士舘大学"
        },
        {
          "rank": 7,
          "time": "1:01:31",
          "name": "デイビッド シュンゲヤネイヤイ",
          "grade": "2",
          "team": "麗沢大学"
        },
        {
          "rank": 8,
          "time": "1:01:39",
          "name": "ジョンソン モゲニ",
          "grade": "1",
          "team": "亜細亜大学"
        },
        {
          "rank": 9,
          "time": "1:01:42",
          "name": "前田和摩",
          "grade": "2",
          "team": "東京農業大学"
        },
        {
          "rank": 10,
          "time": "1:01:56",
          "name": "スティーブン レマイヤン",
          "grade": "1",
          "team": "駿河台大学"
        },
        {
          "rank": 11,
          "time": "1:01:59",
          "name": "吉田礼志",
          "grade": "3",
          "team": "中央学院大学"
        },
        {
          "rank": 12,
          "time": "1:02:11",
          "name": "リチャード エティーリ",
          "grade": "1",
          "team": "東京国際大学"
        },
        {
          "rank": 13,
          "time": "1:02:12",
          "name": "小林篤貴",
          "grade": "4",
          "team": "神奈川大学"
        },
        {
          "rank": 14,
          "time": "1:02:15",
          "name": "関口絢太",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 15,
          "time": "1:02:19",
          "name": "西川千青",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 16,
          "time": "1:02:23",
          "name": "久保田徹",
          "grade": "4",
          "team": "大東文化大学"
        },
        {
          "rank": 17,
          "time": "1:02:23",
          "name": "ラファエル ロンギサ",
          "grade": "1",
          "team": "拓殖大学"
        },
        {
          "rank": 18,
          "time": "1:02:23",
          "name": "北村惇生",
          "grade": "4",
          "team": "山梨学院大学"
        },
        {
          "rank": 19,
          "time": "1:02:24",
          "name": "山口廉",
          "grade": "3",
          "team": "日本体育大学"
        },
        {
          "rank": 20,
          "time": "1:02:25",
          "name": "橋本章央",
          "grade": "4",
          "team": "芝浦工業大学"
        },
        {
          "rank": 21,
          "time": "1:02:26",
          "name": "福田翔",
          "grade": "3",
          "team": "帝京大学"
        },
        {
          "rank": 22,
          "time": "1:02:28",
          "name": "ダンカン キサイサ",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 23,
          "time": "1:02:28",
          "name": "菊地駿介",
          "grade": "4",
          "team": "大東文化大学"
        },
        {
          "rank": 24,
          "time": "1:02:30",
          "name": "木村有希",
          "grade": "3",
          "team": "慶応義塾大学"
        },
        {
          "rank": 25,
          "time": "1:02:30",
          "name": "児玉真輝",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 26,
          "time": "1:02:32",
          "name": "ネルソン マンデランビティ",
          "grade": "2",
          "team": "桜美林大学"
        },
        {
          "rank": 27,
          "time": "1:02:32",
          "name": "伊藤秀虎",
          "grade": "4",
          "team": "中央学院大学"
        },
        {
          "rank": 28,
          "time": "1:02:33",
          "name": "ジョセフ ムイガイ",
          "grade": "1",
          "team": "平成国際大学"
        },
        {
          "rank": 29,
          "time": "1:02:35",
          "name": "新山舜心",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 30,
          "time": "1:02:35",
          "name": "並木寧音",
          "grade": "4",
          "team": "東京農業大学"
        },
        {
          "rank": 31,
          "time": "1:02:35",
          "name": "馬場賢人",
          "grade": "2",
          "team": "立教大学"
        },
        {
          "rank": 32,
          "time": "1:02:38",
          "name": "宇津野篤",
          "grade": "4",
          "team": "神奈川大学"
        },
        {
          "rank": 33,
          "time": "1:02:39",
          "name": "大森椋太",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 34,
          "time": "1:02:41",
          "name": "吉川響",
          "grade": "2",
          "team": "明治大学"
        },
        {
          "rank": 35,
          "time": "1:02:46",
          "name": "綾一輝",
          "grade": "1",
          "team": "明治大学"
        },
        {
          "rank": 36,
          "time": "1:02:47",
          "name": "中山凛斗",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 37,
          "time": "1:02:58",
          "name": "鈴木天智",
          "grade": "2",
          "team": "東海大学"
        },
        {
          "rank": 38,
          "time": "1:02:59",
          "name": "末次海斗",
          "grade": "4",
          "team": "帝京大学"
        },
        {
          "rank": 39,
          "time": "1:03:02",
          "name": "山中博生",
          "grade": "3",
          "team": "帝京大学"
        },
        {
          "rank": 40,
          "time": "1:03:02",
          "name": "川内琉生",
          "grade": "2",
          "team": "東京国際大学"
        },
        {
          "rank": 41,
          "time": "1:03:04",
          "name": "海村蓮",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 42,
          "time": "1:03:04",
          "name": "生駒直幸",
          "grade": "2",
          "team": "国士舘大学"
        },
        {
          "rank": 43,
          "time": "1:03:05",
          "name": "山本龍神",
          "grade": "4",
          "team": "国士舘大学"
        },
        {
          "rank": 44,
          "time": "1:03:05",
          "name": "鈴木康也",
          "grade": "3",
          "team": "麗沢大学"
        },
        {
          "rank": 45,
          "time": "1:03:06",
          "name": "田島公太郎",
          "grade": "3",
          "team": "慶応義塾大学"
        },
        {
          "rank": 46,
          "time": "1:03:07",
          "name": "小嶋郁依斗",
          "grade": "3",
          "team": "京都産業大学"
        },
        {
          "rank": 47,
          "time": "1:03:08",
          "name": "国安広人",
          "grade": "2",
          "team": "立教大学"
        },
        {
          "rank": 48,
          "time": "1:03:09",
          "name": "ボニフェス ムテチ",
          "grade": "1",
          "team": "流通経済大学"
        },
        {
          "rank": 49,
          "time": "1:03:09",
          "name": "宮本陽叶",
          "grade": "2",
          "team": "神奈川大学"
        },
        {
          "rank": 50,
          "time": "1:03:10",
          "name": "柴戸遼太",
          "grade": "2",
          "team": "帝京大学"
        }
      ],
      "source": "https://genkimanman.com/halfmarathon/hakoneyosen/hakoneyosen2023.html"
    },
    "2024": {
      "year": 2024,
      "eventYear": 2024,
      "hakoneEdition": 101,
      "teams": [
        {
          "rank": 1,
          "time": "10:52:36",
          "team": "立教大学"
        },
        {
          "rank": 2,
          "time": "10:53:39",
          "team": "専修大学"
        },
        {
          "rank": 3,
          "time": "10:54:06",
          "team": "山梨学院大学"
        },
        {
          "rank": 4,
          "time": "10:55:58",
          "team": "日本体育大学"
        },
        {
          "rank": 5,
          "time": "10:56:01",
          "team": "中央学院大学"
        },
        {
          "rank": 6,
          "time": "10:56:03",
          "team": "中央大学"
        },
        {
          "rank": 7,
          "time": "10:56:53",
          "team": "日本大学"
        },
        {
          "rank": 8,
          "time": "10:58:53",
          "team": "東京国際大学"
        },
        {
          "rank": 9,
          "time": "10:59:12",
          "team": "神奈川大学"
        },
        {
          "rank": 10,
          "time": "11:01:25",
          "team": "順天堂大学"
        },
        {
          "rank": 11,
          "time": "11:01:26",
          "team": "東京農業大学"
        },
        {
          "rank": 12,
          "time": "11:02:24",
          "team": "明治大学"
        },
        {
          "rank": 13,
          "time": "11:02:40",
          "team": "国士舘大学"
        },
        {
          "rank": 14,
          "time": "11:03:39",
          "team": "東海大学"
        },
        {
          "rank": 15,
          "time": "11:05:11",
          "team": "流通経済大学"
        },
        {
          "rank": 16,
          "time": "11:09:10",
          "team": "駿河台大学"
        },
        {
          "rank": 17,
          "time": "11:12:05",
          "team": "麗澤大学"
        },
        {
          "rank": 18,
          "time": "11:12:17",
          "team": "筑波大学"
        },
        {
          "rank": 19,
          "time": "11:12:56",
          "team": "明治学院大学"
        },
        {
          "rank": 20,
          "time": "11:15:24",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 21,
          "time": "11:15:30",
          "team": "日本薬科大学"
        },
        {
          "rank": 22,
          "time": "11:16:03",
          "team": "拓殖大学"
        },
        {
          "rank": 23,
          "time": "11:16:13",
          "team": "芝浦工業大学"
        },
        {
          "rank": 24,
          "time": "11:16:20",
          "team": "上武大学"
        },
        {
          "rank": 25,
          "time": "11:16:29",
          "team": "平成国際大学"
        },
        {
          "rank": 26,
          "time": "11:21:04",
          "team": "東京経済大学"
        },
        {
          "rank": 27,
          "time": "11:21:51",
          "team": "亜細亜大学"
        },
        {
          "rank": 28,
          "time": "11:22:04",
          "team": "桜美林大学"
        },
        {
          "rank": 29,
          "time": "11:23:10",
          "team": "慶應義塾大学"
        },
        {
          "rank": 30,
          "time": "11:24:25",
          "team": "関東学院大学"
        },
        {
          "rank": 31,
          "time": "11:38:51",
          "team": "育英大学"
        },
        {
          "rank": 32,
          "time": "11:41:46",
          "team": "立正大学"
        },
        {
          "rank": 33,
          "time": "11:55:40",
          "team": "湘南工科大学"
        },
        {
          "rank": 34,
          "time": "11:58:35",
          "team": "国際武道大学"
        },
        {
          "rank": 35,
          "time": "12:02:53",
          "team": "清和大学"
        },
        {
          "rank": 36,
          "time": "12:03:21",
          "team": "東京大学"
        },
        {
          "rank": 37,
          "time": "12:13:59",
          "team": "東京大学大学院"
        },
        {
          "rank": 38,
          "time": "12:23:49",
          "team": "東京科学大学"
        },
        {
          "rank": 39,
          "time": "12:29:22",
          "team": "東京理科大学"
        },
        {
          "rank": 40,
          "time": "12:30:34",
          "team": "一橋大学"
        },
        {
          "rank": 41,
          "time": "12:34:39",
          "team": "千葉大学"
        },
        {
          "rank": 42,
          "time": "12:50:47",
          "team": "防衛大学校"
        },
        {
          "rank": 43,
          "time": "12:53:33",
          "team": "埼玉大学"
        }
      ],
      "individuals": [
        {
          "rank": 1,
          "time": "1:00:59",
          "name": "シャドラック キップケメイ",
          "grade": "2",
          "team": "日本大学"
        },
        {
          "rank": 2,
          "time": "1:01:02",
          "name": "ブライアン キピエゴ",
          "grade": "2",
          "team": "山梨学院大学"
        },
        {
          "rank": 3,
          "time": "1:01:47",
          "name": "ダンカン マイナ",
          "grade": "1",
          "team": "専修大学"
        },
        {
          "rank": 4,
          "time": "1:01:54",
          "name": "カマウ パトリック",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 5,
          "time": "1:01:58",
          "name": "スティーブン レマイヤン",
          "grade": "2",
          "team": "駿河台大学"
        },
        {
          "rank": 6,
          "time": "1:02:27",
          "name": "デニス キプルト",
          "grade": "2",
          "team": "日本薬科大学"
        },
        {
          "rank": 7,
          "time": "1:02:46",
          "name": "ジョセフ ムイガイ",
          "grade": "2",
          "team": "平成国際大学"
        },
        {
          "rank": 8,
          "time": "1:03:02",
          "name": "ジョンソン モゲニ",
          "grade": "2",
          "team": "亜細亜大学"
        },
        {
          "rank": 9,
          "time": "1:03:22",
          "name": "ラファエル ロンギサ",
          "grade": "2",
          "team": "拓殖大学"
        },
        {
          "rank": 10,
          "time": "1:03:29",
          "name": "吉田礼志",
          "grade": "4",
          "team": "中央学院大学"
        },
        {
          "rank": 11,
          "time": "1:03:35",
          "name": "リチャード エティーリ",
          "grade": "2",
          "team": "東京国際大学"
        },
        {
          "rank": 12,
          "time": "1:03:38",
          "name": "ネルソン マンデランビティ",
          "grade": "3",
          "team": "桜美林大学"
        },
        {
          "rank": 13,
          "time": "1:03:41",
          "name": "ビニアムテスファイゼラツィオン",
          "grade": "1",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 14,
          "time": "1:03:49",
          "name": "浅井皓貴",
          "grade": "4",
          "team": "順天堂大学"
        },
        {
          "rank": 15,
          "time": "1:03:56",
          "name": "馬場賢人",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 16,
          "time": "1:03:56",
          "name": "山崎丞",
          "grade": "3",
          "team": "日本体育大学"
        },
        {
          "rank": 17,
          "time": "1:03:58",
          "name": "白川陽大",
          "grade": "3",
          "team": "中央大学"
        },
        {
          "rank": 18,
          "time": "1:04:08",
          "name": "近田陽路",
          "grade": "3",
          "team": "中央学院大学"
        },
        {
          "rank": 19,
          "time": "1:04:12",
          "name": "平島龍斗",
          "grade": "3",
          "team": "日本体育大学"
        },
        {
          "rank": 20,
          "time": "1:04:17",
          "name": "ピーター カマウ",
          "grade": "4",
          "team": "国士舘大学"
        },
        {
          "rank": 21,
          "time": "1:04:22",
          "name": "新井友裕",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 22,
          "time": "1:04:27",
          "name": "小山洋生",
          "grade": "3",
          "team": "筑波大学"
        },
        {
          "rank": 23,
          "time": "1:04:27",
          "name": "花岡寿哉",
          "grade": "3",
          "team": "東海大学"
        },
        {
          "rank": 24,
          "time": "1:04:28",
          "name": "岡田開成",
          "grade": "1",
          "team": "中央大学"
        },
        {
          "rank": 25,
          "time": "1:04:31",
          "name": "林虎大朗",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 26,
          "time": "1:04:32",
          "name": "上山詩樹",
          "grade": "2",
          "team": "専修大学"
        },
        {
          "rank": 27,
          "time": "1:04:33",
          "name": "森川蒼太",
          "grade": "4",
          "team": "流通経済大学"
        },
        {
          "rank": 28,
          "time": "1:04:35",
          "name": "田島公太郎",
          "grade": "4",
          "team": "慶応義塾大学"
        },
        {
          "rank": 29,
          "time": "1:04:35",
          "name": "桧垣蒼",
          "grade": "1",
          "team": "東海大学"
        },
        {
          "rank": 30,
          "time": "1:04:37",
          "name": "国安広人",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 31,
          "time": "1:04:38",
          "name": "佐藤榛紀",
          "grade": "4",
          "team": "東京国際大学"
        },
        {
          "rank": 32,
          "time": "1:04:41",
          "name": "工藤大和",
          "grade": "4",
          "team": "麗沢大学"
        },
        {
          "rank": 33,
          "time": "1:04:43",
          "name": "田島駿介",
          "grade": "3",
          "team": "日本体育大学"
        },
        {
          "rank": 34,
          "time": "1:04:51",
          "name": "大仲竜平",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 35,
          "time": "1:04:57",
          "name": "大林洸己",
          "grade": "4",
          "team": "東京国際大学"
        },
        {
          "rank": 36,
          "time": "1:04:58",
          "name": "阿部陽樹",
          "grade": "4",
          "team": "中央大学"
        },
        {
          "rank": 37,
          "time": "1:04:58",
          "name": "海老沢憲伸",
          "grade": "4",
          "team": "順天堂大学"
        },
        {
          "rank": 38,
          "time": "1:05:00",
          "name": "佐藤碧",
          "grade": "4",
          "team": "平成国際大学"
        },
        {
          "rank": 39,
          "time": "1:05:01",
          "name": "塚田萌成",
          "grade": "5",
          "team": "筑波大学"
        },
        {
          "rank": 40,
          "time": "1:05:01",
          "name": "原田望睦",
          "grade": "1",
          "team": "中央大学"
        },
        {
          "rank": 41,
          "time": "1:05:02",
          "name": "酒井健成",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 42,
          "time": "1:05:03",
          "name": "鈴木康也",
          "grade": "4",
          "team": "麗沢大学"
        },
        {
          "rank": 43,
          "time": "1:05:03",
          "name": "安藤圭佑",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 44,
          "time": "1:05:07",
          "name": "菅野裕二郎",
          "grade": "3",
          "team": "東京国際大学"
        },
        {
          "rank": 45,
          "time": "1:05:08",
          "name": "阿部紘也",
          "grade": "1",
          "team": "山梨学院大学"
        },
        {
          "rank": 46,
          "time": "1:05:09",
          "name": "栗本航希",
          "grade": "2",
          "team": "東京農業大学"
        },
        {
          "rank": 47,
          "time": "1:05:09",
          "name": "佐藤大介",
          "grade": "1",
          "team": "中央大学"
        },
        {
          "rank": 48,
          "time": "1:05:11",
          "name": "長谷川瑠",
          "grade": "4",
          "team": "流通経済大学"
        },
        {
          "rank": 49,
          "time": "1:05:11",
          "name": "水野龍志",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 50,
          "time": "1:05:12",
          "name": "古川達也",
          "grade": "2",
          "team": "順天堂大学"
        },
        {
          "rank": 51,
          "time": "1:05:12",
          "name": "南坂柚汰",
          "grade": "2",
          "team": "東海大学"
        },
        {
          "rank": 52,
          "time": "1:05:13",
          "name": "大岩蓮",
          "grade": "2",
          "team": "神奈川大学"
        },
        {
          "rank": 53,
          "time": "1:05:13",
          "name": "岡崎樹",
          "grade": "3",
          "team": "駿河台大学"
        },
        {
          "rank": 54,
          "time": "1:05:14",
          "name": "東晃成",
          "grade": "3",
          "team": "麗沢大学"
        },
        {
          "rank": 55,
          "time": "1:05:15",
          "name": "西田大智",
          "grade": "4",
          "team": "国士舘大学"
        },
        {
          "rank": 56,
          "time": "1:05:15",
          "name": "久保俊翔",
          "grade": "2",
          "team": "駿河台大学"
        },
        {
          "rank": 57,
          "time": "1:05:16",
          "name": "安藤風羽",
          "grade": "4",
          "team": "日本大学"
        },
        {
          "rank": 58,
          "time": "1:05:16",
          "name": "富田悠晟",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 59,
          "time": "1:05:16",
          "name": "志食隆希",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 60,
          "time": "1:05:17",
          "name": "古川大晃",
          "grade": "4",
          "team": "東京大学大学院"
        },
        {
          "rank": 61,
          "time": "1:05:18",
          "name": "川勝悠雅",
          "grade": "3",
          "team": "国士舘大学"
        },
        {
          "rank": 62,
          "time": "1:05:18",
          "name": "宮本大心",
          "grade": "1",
          "team": "芝浦工業大学"
        },
        {
          "rank": 63,
          "time": "1:05:19",
          "name": "栗原舜",
          "grade": "4",
          "team": "明治学院大学"
        },
        {
          "rank": 64,
          "time": "1:05:19",
          "name": "辻本幸翼",
          "grade": "4",
          "team": "上武大学"
        },
        {
          "rank": 65,
          "time": "1:05:19",
          "name": "柴田大輝",
          "grade": "4",
          "team": "中央学院大学"
        },
        {
          "rank": 66,
          "time": "1:05:20",
          "name": "土器屋快都",
          "grade": "4",
          "team": "山梨学院大学"
        },
        {
          "rank": 67,
          "time": "1:05:20",
          "name": "山下大毅",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 68,
          "time": "1:05:22",
          "name": "小倉史也",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 69,
          "time": "1:05:23",
          "name": "平八重充希",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 70,
          "time": "1:05:23",
          "name": "和田瑛登",
          "grade": "2",
          "team": "山梨学院大学"
        },
        {
          "rank": 71,
          "time": "1:05:24",
          "name": "吉屋佑晟",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 72,
          "time": "1:05:26",
          "name": "横田星那",
          "grade": "3",
          "team": "国士舘大学"
        },
        {
          "rank": 73,
          "time": "1:05:28",
          "name": "野島健太",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 74,
          "time": "1:05:29",
          "name": "植月俊太",
          "grade": "2",
          "team": "東京農業大学"
        },
        {
          "rank": 75,
          "time": "1:05:29",
          "name": "西坂昂也",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 76,
          "time": "1:05:29",
          "name": "佐藤我駆人",
          "grade": "1",
          "team": "駿河台大学"
        },
        {
          "rank": 77,
          "time": "1:05:30",
          "name": "秋吉拓真",
          "grade": "3",
          "team": "東京大学"
        },
        {
          "rank": 78,
          "time": "1:05:30",
          "name": "近藤大智",
          "grade": "2",
          "team": "神奈川大学"
        },
        {
          "rank": 79,
          "time": "1:05:31",
          "name": "片川祐大",
          "grade": "4",
          "team": "亜細亜大学"
        },
        {
          "rank": 80,
          "time": "1:05:32",
          "name": "原田颯大",
          "grade": "2",
          "team": "立教大学"
        },
        {
          "rank": 81,
          "time": "1:05:34",
          "name": "分須尊紀",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 82,
          "time": "1:05:34",
          "name": "山口廉",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 83,
          "time": "1:05:36",
          "name": "吉川響",
          "grade": "3",
          "team": "明治大学"
        },
        {
          "rank": 84,
          "time": "1:05:36",
          "name": "溝上稜斗",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 85,
          "time": "1:05:39",
          "name": "住原聡太",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 86,
          "time": "1:05:40",
          "name": "川内琉生",
          "grade": "3",
          "team": "東京国際大学"
        },
        {
          "rank": 87,
          "time": "1:05:41",
          "name": "上田航大",
          "grade": "1",
          "team": "神奈川大学"
        },
        {
          "rank": 88,
          "time": "1:05:42",
          "name": "市川大世",
          "grade": "2",
          "team": "中央学院大学"
        },
        {
          "rank": 89,
          "time": "1:05:44",
          "name": "具志堅一斗",
          "grade": "2",
          "team": "専修大学"
        },
        {
          "rank": 90,
          "time": "1:05:46",
          "name": "梶谷優斗",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 91,
          "time": "1:05:46",
          "name": "山口史朗",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 92,
          "time": "1:05:47",
          "name": "大田和一斗",
          "grade": "4",
          "team": "専修大学"
        },
        {
          "rank": 93,
          "time": "1:05:47",
          "name": "土田隼司",
          "grade": "1",
          "team": "明治大学"
        },
        {
          "rank": 94,
          "time": "1:05:47",
          "name": "ボニフェス ムテチ",
          "grade": "2",
          "team": "流通経済大学"
        },
        {
          "rank": 95,
          "time": "1:05:49",
          "name": "藤原稜太",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 96,
          "time": "1:05:50",
          "name": "大村良紀",
          "grade": "3",
          "team": "東京国際大学"
        },
        {
          "rank": 97,
          "time": "1:05:52",
          "name": "原田洋輔",
          "grade": "3",
          "team": "東京農業大学"
        },
        {
          "rank": 98,
          "time": "1:05:53",
          "name": "吉岡大翔",
          "grade": "2",
          "team": "順天堂大学"
        },
        {
          "rank": 99,
          "time": "1:05:53",
          "name": "小島准",
          "grade": "4",
          "team": "流通経済大学"
        },
        {
          "rank": 100,
          "time": "1:05:53",
          "name": "早稲田蓮",
          "grade": "3",
          "team": "駿河台大学"
        }
      ],
      "source": "https://genkimanman.com/halfmarathon/hakoneyosen/hakoneyosen2024.html"
    },
    "2025": {
      "year": 2025,
      "eventYear": 2025,
      "hakoneEdition": 102,
      "teams": [
        {
          "rank": 1,
          "time": "10:32:23",
          "team": "中央学院大学"
        },
        {
          "rank": 2,
          "time": "10:32:35",
          "team": "順天堂大学"
        },
        {
          "rank": 3,
          "time": "10:32:44",
          "team": "山梨学院大学"
        },
        {
          "rank": 4,
          "time": "10:32:57",
          "team": "日本大学"
        },
        {
          "rank": 5,
          "time": "10:34:07",
          "team": "東海大学"
        },
        {
          "rank": 6,
          "time": "10:34:59",
          "team": "東京農業大学"
        },
        {
          "rank": 7,
          "time": "10:36:07",
          "team": "神奈川大学"
        },
        {
          "rank": 8,
          "time": "10:36:12",
          "team": "大東文化大学"
        },
        {
          "rank": 9,
          "time": "10:36:14",
          "team": "日本体育大学"
        },
        {
          "rank": 10,
          "time": "10:36:56",
          "team": "立教大学"
        },
        {
          "rank": 11,
          "time": "10:37:13",
          "team": "法政大学"
        },
        {
          "rank": 12,
          "time": "10:38:54",
          "team": "明治大学"
        },
        {
          "rank": 13,
          "time": "10:39:06",
          "team": "専修大学"
        },
        {
          "rank": 14,
          "time": "10:40:25",
          "team": "日本薬科大学"
        },
        {
          "rank": 15,
          "time": "10:40:42",
          "team": "駿河台大学"
        },
        {
          "rank": 16,
          "time": "10:44:03",
          "team": "筑波大学"
        },
        {
          "rank": 17,
          "time": "10:48:23",
          "team": "拓殖大学"
        },
        {
          "rank": 18,
          "time": "10:49:07",
          "team": "芝浦工業大学"
        },
        {
          "rank": 19,
          "time": "10:49:25",
          "team": "国士舘大学"
        },
        {
          "rank": 20,
          "time": "10:50:36",
          "team": "上武大学"
        },
        {
          "rank": 21,
          "time": "10:50:42",
          "team": "麗沢大学"
        },
        {
          "rank": 22,
          "time": "10:51:48",
          "team": "明治学院大学"
        },
        {
          "rank": 23,
          "time": "10:52:18",
          "team": "桜美林大学"
        },
        {
          "rank": 24,
          "time": "10:52:27",
          "team": "平成国際大学"
        },
        {
          "rank": 25,
          "time": "10:52:35",
          "team": "流通経済大学"
        },
        {
          "rank": 26,
          "time": "10:52:37",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 27,
          "time": "10:53:14",
          "team": "亜細亜大学"
        },
        {
          "rank": 28,
          "time": "11:00:38",
          "team": "東京経済大学"
        },
        {
          "rank": 29,
          "time": "11:03:23",
          "team": "関東学院大学"
        },
        {
          "rank": 30,
          "time": "11:06:48",
          "team": "慶応義塾大学"
        },
        {
          "rank": 31,
          "time": "11:07:53",
          "team": "育英大学"
        },
        {
          "rank": 32,
          "time": "11:15:22",
          "team": "立正大学"
        },
        {
          "rank": 33,
          "time": "11:22:36",
          "team": "国際武道大学"
        },
        {
          "rank": 34,
          "time": "11:23:52",
          "team": "東京大学大学院"
        },
        {
          "rank": 35,
          "time": "11:36:55",
          "team": "清和大学"
        },
        {
          "rank": 36,
          "time": "11:42:58",
          "team": "東京大学"
        },
        {
          "rank": 37,
          "time": "11:43:07",
          "team": "湘南工科大学"
        },
        {
          "rank": 38,
          "time": "11:49:04",
          "team": "東京理科大学"
        },
        {
          "rank": 39,
          "time": "11:53:36",
          "team": "千葉大学"
        },
        {
          "rank": 40,
          "time": "12:02:09",
          "team": "一橋大学"
        },
        {
          "rank": 41,
          "time": "12:12:23",
          "team": "埼玉大学"
        },
        {
          "rank": 42,
          "time": "記録なし",
          "team": "防衛大学校"
        }
      ],
      "individuals": [
        {
          "rank": 1,
          "time": "1:00:16",
          "name": "ブライアン キピエゴ",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 2,
          "time": "1:00:31",
          "name": "シャドラック キップケメイ",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 3,
          "time": "1:00:52",
          "name": "ジョセフ ムイガイ",
          "grade": "3",
          "team": "平成国際大学"
        },
        {
          "rank": 4,
          "time": "1:00:58",
          "name": "ラファエル ロンギサ",
          "grade": "3",
          "team": "拓殖大学"
        },
        {
          "rank": 5,
          "time": "1:01:10",
          "name": "カマウ パトリック",
          "grade": "4",
          "team": "上武大学"
        },
        {
          "rank": 6,
          "time": "1:02:04",
          "name": "スティーブン レマイヤン",
          "grade": "3",
          "team": "駿河台大学"
        },
        {
          "rank": 7,
          "time": "1:02:04",
          "name": "近田陽路",
          "grade": "4",
          "team": "中央学院大学"
        },
        {
          "rank": 8,
          "time": "1:02:06",
          "name": "平島龍斗",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 9,
          "time": "1:02:08",
          "name": "ビニアム テスファイゼラツィオン",
          "grade": "3",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 10,
          "time": "1:02:09",
          "name": "阿部紘也",
          "grade": "2",
          "team": "山梨学院大学"
        },
        {
          "rank": 11,
          "time": "1:02:10",
          "name": "花岡寿哉",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 12,
          "time": "1:02:12",
          "name": "秋吉拓真",
          "grade": "4",
          "team": "東京大学"
        },
        {
          "rank": 13,
          "time": "1:02:12",
          "name": "ブライアン キプトゥーブシューアキットゥ",
          "grade": "2",
          "team": "麗沢大学"
        },
        {
          "rank": 14,
          "time": "1:02:12",
          "name": "前田和摩",
          "grade": "3",
          "team": "東京農業大学"
        },
        {
          "rank": 15,
          "time": "1:02:13",
          "name": "古橋希翁",
          "grade": "3",
          "team": "駿河台大学"
        },
        {
          "rank": 16,
          "time": "1:02:15",
          "name": "田島駿介",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 17,
          "time": "1:02:16",
          "name": "デニス キプルト",
          "grade": "3",
          "team": "日本薬科大学"
        },
        {
          "rank": 18,
          "time": "1:02:16",
          "name": "市川大世",
          "grade": "3",
          "team": "中央学院大学"
        },
        {
          "rank": 19,
          "time": "1:02:20",
          "name": "川崎颯",
          "grade": "3",
          "team": "筑波大学"
        },
        {
          "rank": 20,
          "time": "1:02:20",
          "name": "原田颯大",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 21,
          "time": "1:02:21",
          "name": "栗本航希",
          "grade": "3",
          "team": "東京農業大学"
        },
        {
          "rank": 22,
          "time": "1:02:23",
          "name": "永本修",
          "grade": "3",
          "team": "東海大学"
        },
        {
          "rank": 23,
          "time": "1:02:23",
          "name": "入浜輝大",
          "grade": "4",
          "team": "大東文化大学"
        },
        {
          "rank": 24,
          "time": "1:02:32",
          "name": "和田瑛登",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 25,
          "time": "1:02:34",
          "name": "兵藤ジュダ",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 26,
          "time": "1:02:34",
          "name": "吉岡大翔",
          "grade": "3",
          "team": "順天堂大学"
        },
        {
          "rank": 27,
          "time": "1:02:35",
          "name": "原田洋輔",
          "grade": "4",
          "team": "東京農業大学"
        },
        {
          "rank": 28,
          "time": "1:02:35",
          "name": "中沢真大",
          "grade": "2",
          "team": "大東文化大学"
        },
        {
          "rank": 29,
          "time": "1:02:36",
          "name": "野田晶斗",
          "grade": "3",
          "team": "法政大学"
        },
        {
          "rank": 30,
          "time": "1:02:38",
          "name": "深堀優",
          "grade": "4",
          "team": "東京農業大学"
        },
        {
          "rank": 31,
          "time": "1:02:46",
          "name": "小林侑世",
          "grade": "3",
          "team": "順天堂大学"
        },
        {
          "rank": 32,
          "time": "1:02:49",
          "name": "大島史也",
          "grade": "4",
          "team": "法政大学"
        },
        {
          "rank": 33,
          "time": "1:02:49",
          "name": "国安広人",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 34,
          "time": "1:02:50",
          "name": "宮本陽叶",
          "grade": "4",
          "team": "神奈川大学"
        },
        {
          "rank": 35,
          "time": "1:02:50",
          "name": "井上朋哉",
          "grade": "1",
          "team": "順天堂大学"
        },
        {
          "rank": 36,
          "time": "1:02:54",
          "name": "染谷雄輝",
          "grade": "4",
          "team": "日本薬科大学"
        },
        {
          "rank": 37,
          "time": "1:02:54",
          "name": "マイナ ダンカン",
          "grade": "2",
          "team": "専修大学"
        },
        {
          "rank": 38,
          "time": "1:02:57",
          "name": "長部虎太郎",
          "grade": "2",
          "team": "中央学院大学"
        },
        {
          "rank": 39,
          "time": "1:03:00",
          "name": "棟方一楽",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 40,
          "time": "1:03:01",
          "name": "平八重充希",
          "grade": "4",
          "team": "山梨学院大学"
        },
        {
          "rank": 41,
          "time": "1:03:01",
          "name": "小島岳斗",
          "grade": "4",
          "team": "東京農業大学"
        },
        {
          "rank": 42,
          "time": "1:03:06",
          "name": "中沢星音",
          "grade": "4",
          "team": "日本大学"
        },
        {
          "rank": 43,
          "time": "1:03:06",
          "name": "山本悠",
          "grade": "2",
          "team": "順天堂大学"
        },
        {
          "rank": 44,
          "time": "1:03:06",
          "name": "小倉史也",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 45,
          "time": "1:03:08",
          "name": "ボニフェス ムテチ",
          "grade": "3",
          "team": "流通経済大学"
        },
        {
          "rank": 46,
          "time": "1:03:08",
          "name": "大湊柊翔",
          "grade": "3",
          "team": "明治大学"
        },
        {
          "rank": 47,
          "time": "1:03:09",
          "name": "松浦輝仁",
          "grade": "2",
          "team": "大東文化大学"
        },
        {
          "rank": 48,
          "time": "1:03:11",
          "name": "上田航大",
          "grade": "2",
          "team": "神奈川大学"
        },
        {
          "rank": 49,
          "time": "1:03:11",
          "name": "三代田宏太朗",
          "grade": "2",
          "team": "中央学院大学"
        },
        {
          "rank": 50,
          "time": "1:03:12",
          "name": "新井友裕",
          "grade": "4",
          "team": "専修大学"
        },
        {
          "rank": 51,
          "time": "1:03:12",
          "name": "佐野颯人",
          "grade": "3",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 52,
          "time": "1:03:12",
          "name": "三角洸太",
          "grade": "4",
          "team": "中央学院大学"
        },
        {
          "rank": 53,
          "time": "1:03:15",
          "name": "山口彰太",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 54,
          "time": "1:03:15",
          "name": "森下翔太",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 55,
          "time": "1:03:16",
          "name": "吉屋佑晟",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 56,
          "time": "1:03:16",
          "name": "林愛斗",
          "grade": "3",
          "team": "中央学院大学"
        },
        {
          "rank": 57,
          "time": "1:03:16",
          "name": "山崎丞",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 58,
          "time": "1:03:18",
          "name": "酒井健成",
          "grade": "4",
          "team": "神奈川大学"
        },
        {
          "rank": 59,
          "time": "1:03:18",
          "name": "島居優成",
          "grade": "2",
          "team": "日本薬科大学"
        },
        {
          "rank": 60,
          "time": "1:03:18",
          "name": "古川達也",
          "grade": "3",
          "team": "順天堂大学"
        },
        {
          "rank": 61,
          "time": "1:03:18",
          "name": "天野啓太",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 62,
          "time": "1:03:19",
          "name": "横田星那",
          "grade": "4",
          "team": "国士舘大学"
        },
        {
          "rank": 63,
          "time": "1:03:19",
          "name": "上山詩樹",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 64,
          "time": "1:03:20",
          "name": "小林晴琉",
          "grade": "1",
          "team": "筑波大学"
        },
        {
          "rank": 65,
          "time": "1:03:21",
          "name": "江原守平",
          "grade": "4",
          "team": "日本薬科大学"
        },
        {
          "rank": 66,
          "time": "1:03:22",
          "name": "石岡大侑",
          "grade": "4",
          "team": "順天堂大学"
        },
        {
          "rank": 67,
          "time": "1:03:22",
          "name": "野口颯汰",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 68,
          "time": "1:03:23",
          "name": "川原琉人",
          "grade": "2",
          "team": "順天堂大学"
        },
        {
          "rank": 69,
          "time": "1:03:24",
          "name": "河原大和",
          "grade": "3",
          "team": "日本薬科大学"
        },
        {
          "rank": 70,
          "time": "1:03:24",
          "name": "三原涼雅",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 71,
          "time": "1:03:27",
          "name": "徳善龍",
          "grade": "2",
          "team": "中央学院大学"
        },
        {
          "rank": 72,
          "time": "1:03:28",
          "name": "高橋歩夢",
          "grade": "3",
          "team": "明治学院大学"
        },
        {
          "rank": 73,
          "time": "1:03:28",
          "name": "鈴木孔士",
          "grade": "4",
          "team": "日本大学"
        },
        {
          "rank": 74,
          "time": "1:03:28",
          "name": "平井蒼大",
          "grade": "3",
          "team": "法政大学"
        },
        {
          "rank": 75,
          "time": "1:03:28",
          "name": "ネルソン マンデランビティ",
          "grade": "4",
          "team": "桜美林大学"
        },
        {
          "rank": 76,
          "time": "1:03:29",
          "name": "小山洋生",
          "grade": "3",
          "team": "筑波大学"
        },
        {
          "rank": 77,
          "time": "1:03:29",
          "name": "花井創",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 78,
          "time": "1:03:30",
          "name": "林龍正",
          "grade": "3",
          "team": "順天堂大学"
        },
        {
          "rank": 79,
          "time": "1:03:30",
          "name": "大仲竜平",
          "grade": "4",
          "team": "日本大学"
        },
        {
          "rank": 80,
          "time": "1:03:31",
          "name": "堀颯介",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 81,
          "time": "1:03:32",
          "name": "平井璃空",
          "grade": "2",
          "team": "東海大学"
        },
        {
          "rank": 82,
          "time": "1:03:34",
          "name": "滝本朗史",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 83,
          "time": "1:03:35",
          "name": "丹柊太郎",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 84,
          "time": "1:03:35",
          "name": "花岡慶次",
          "grade": "4",
          "team": "法政大学"
        },
        {
          "rank": 85,
          "time": "1:03:36",
          "name": "中野純平",
          "grade": "2",
          "team": "東海大学"
        },
        {
          "rank": 86,
          "time": "1:03:39",
          "name": "土田隼司",
          "grade": "2",
          "team": "明治大学"
        },
        {
          "rank": 87,
          "time": "1:03:41",
          "name": "ロホマンシュモン",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 88,
          "time": "1:03:43",
          "name": "黒谷優",
          "grade": "4",
          "team": "中央学院大学"
        },
        {
          "rank": 89,
          "time": "1:03:44",
          "name": "佐藤大和",
          "grade": "2",
          "team": "日本体育大学"
        },
        {
          "rank": 90,
          "time": "1:03:44",
          "name": "山下翔吾",
          "grade": "2",
          "team": "立教大学"
        },
        {
          "rank": 91,
          "time": "1:03:44",
          "name": "光安航希",
          "grade": "4",
          "team": "亜細亜大学"
        },
        {
          "rank": 92,
          "time": "1:03:45",
          "name": "井坂光",
          "grade": "1",
          "team": "東京農業大学"
        },
        {
          "rank": 93,
          "time": "1:03:45",
          "name": "大浜逞真",
          "grade": "2",
          "team": "大東文化大学"
        },
        {
          "rank": 94,
          "time": "1:03:45",
          "name": "竹割真",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 95,
          "time": "1:03:45",
          "name": "南坂柚汰",
          "grade": "3",
          "team": "東海大学"
        },
        {
          "rank": 96,
          "time": "1:03:45",
          "name": "山口聡太",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 97,
          "time": "1:03:46",
          "name": "長沢辰朗",
          "grade": "2",
          "team": "日本大学"
        },
        {
          "rank": 98,
          "time": "1:03:48",
          "name": "古井康介",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 99,
          "time": "1:03:48",
          "name": "大倉靖萌",
          "grade": "4",
          "team": "順天堂大学"
        },
        {
          "rank": 100,
          "time": "1:03:50",
          "name": "田原匠真",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 101,
          "time": "1:03:50",
          "name": "太田煌",
          "grade": "1",
          "team": "法政大学"
        },
        {
          "rank": 102,
          "time": "1:03:51",
          "name": "加藤滉隆",
          "grade": "2",
          "team": "明治学院大学"
        },
        {
          "rank": 103,
          "time": "1:03:51",
          "name": "窪田翔",
          "grade": "3",
          "team": "日本薬科大学"
        },
        {
          "rank": 104,
          "time": "1:03:53",
          "name": "鈴木要",
          "grade": "1",
          "team": "大東文化大学"
        },
        {
          "rank": 105,
          "time": "1:03:55",
          "name": "内山寿頼",
          "grade": "4",
          "team": "芝浦工業大学"
        },
        {
          "rank": 106,
          "time": "1:03:55",
          "name": "中村貫太",
          "grade": "2",
          "team": "国士舘大学"
        },
        {
          "rank": 107,
          "time": "1:03:56",
          "name": "松浦海瑠",
          "grade": "4",
          "team": "筑波大学"
        },
        {
          "rank": 108,
          "time": "1:03:56",
          "name": "荻野桂輔",
          "grade": "2",
          "team": "日本体育大学"
        },
        {
          "rank": 109,
          "time": "1:03:56",
          "name": "平松龍青",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 110,
          "time": "1:03:58",
          "name": "二村昇太朗",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 111,
          "time": "1:03:58",
          "name": "本多健亮",
          "grade": "M2",
          "team": "東京大学大学院"
        },
        {
          "rank": 112,
          "time": "1:03:58",
          "name": "大竹雄大",
          "grade": "4",
          "team": "日本体育大学"
        },
        {
          "rank": 113,
          "time": "1:03:58",
          "name": "玉目陸",
          "grade": "2",
          "team": "順天堂大学"
        },
        {
          "rank": 114,
          "time": "1:03:59",
          "name": "相川正樹",
          "grade": "2",
          "team": "平成国際大学"
        },
        {
          "rank": 115,
          "time": "1:03:59",
          "name": "塩田大空",
          "grade": "4",
          "team": "神奈川大学"
        },
        {
          "rank": 116,
          "time": "1:04:00",
          "name": "橋本将汰",
          "grade": "3",
          "team": "立正大学"
        },
        {
          "rank": 117,
          "time": "1:04:00",
          "name": "占部大和",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 118,
          "time": "1:04:00",
          "name": "大杉亮太朗",
          "grade": "2",
          "team": "山梨学院大学"
        },
        {
          "rank": 119,
          "time": "1:04:02",
          "name": "田井中悠成",
          "grade": "3",
          "team": "法政大学"
        },
        {
          "rank": 120,
          "time": "1:04:03",
          "name": "上田翔大",
          "grade": "1",
          "team": "大東文化大学"
        },
        {
          "rank": 121,
          "time": "1:04:03",
          "name": "山本樹",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 122,
          "time": "1:04:03",
          "name": "大岩蓮",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 123,
          "time": "1:04:04",
          "name": "小川優晴",
          "grade": "1",
          "team": "中央学院大学"
        },
        {
          "rank": 124,
          "time": "1:04:05",
          "name": "橋本櫂知",
          "grade": "2",
          "team": "日本大学"
        },
        {
          "rank": 125,
          "time": "1:04:06",
          "name": "沢中響生",
          "grade": "4",
          "team": "法政大学"
        },
        {
          "rank": 126,
          "time": "1:04:07",
          "name": "吉川響",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 127,
          "time": "1:04:08",
          "name": "吉田黎大",
          "grade": "3",
          "team": "日本体育大学"
        },
        {
          "rank": 128,
          "time": "1:04:08",
          "name": "重山弘徳",
          "grade": "3",
          "team": "法政大学"
        },
        {
          "rank": 129,
          "time": "1:04:09",
          "name": "久保俊翔",
          "grade": "3",
          "team": "駿河台大学"
        },
        {
          "rank": 130,
          "time": "1:04:09",
          "name": "柿内心温",
          "grade": "2",
          "team": "拓殖大学"
        },
        {
          "rank": 131,
          "time": "1:04:09",
          "name": "山本琉楓",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 132,
          "time": "1:04:10",
          "name": "志食隆希",
          "grade": "4",
          "team": "神奈川大学"
        },
        {
          "rank": 133,
          "time": "1:04:10",
          "name": "永井駿",
          "grade": "4",
          "team": "立教大学"
        },
        {
          "rank": 134,
          "time": "1:04:11",
          "name": "佐藤陸",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 135,
          "time": "1:04:11",
          "name": "水野夢大",
          "grade": "2",
          "team": "東海大学"
        },
        {
          "rank": 136,
          "time": "1:04:12",
          "name": "塚本陸斗",
          "grade": "4",
          "team": "山梨学院大学"
        },
        {
          "rank": 137,
          "time": "1:04:13",
          "name": "坂本駿",
          "grade": "4",
          "team": "中央学院大学"
        },
        {
          "rank": 138,
          "time": "1:04:13",
          "name": "片桐禅太",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 139,
          "time": "1:04:13",
          "name": "木島陸",
          "grade": "3",
          "team": "立教大学"
        },
        {
          "rank": 140,
          "time": "1:04:13",
          "name": "具志堅一斗",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 141,
          "time": "1:04:16",
          "name": "横尾皓",
          "grade": "4",
          "team": "芝浦工業大学"
        },
        {
          "rank": 142,
          "time": "1:04:16",
          "name": "山際晃太朗",
          "grade": "2",
          "team": "法政大学"
        },
        {
          "rank": 143,
          "time": "1:04:16",
          "name": "大橋正昊",
          "grade": "3",
          "team": "駿河台大学"
        },
        {
          "rank": 144,
          "time": "1:04:17",
          "name": "永原颯磨",
          "grade": "2",
          "team": "順天堂大学"
        },
        {
          "rank": 145,
          "time": "1:04:17",
          "name": "夏見虹郎",
          "grade": "1",
          "team": "日本体育大学"
        },
        {
          "rank": 146,
          "time": "1:04:18",
          "name": "遠藤優裕",
          "grade": "2",
          "team": "神奈川大学"
        },
        {
          "rank": 147,
          "time": "1:04:18",
          "name": "富田悠晟",
          "grade": "4",
          "team": "日本大学"
        },
        {
          "rank": 148,
          "time": "1:04:18",
          "name": "田口萩太",
          "grade": "2",
          "team": "専修大学"
        },
        {
          "rank": 149,
          "time": "1:04:19",
          "name": "松岡一星",
          "grade": "2",
          "team": "山梨学院大学"
        },
        {
          "rank": 150,
          "time": "1:04:19",
          "name": "山崎優汰",
          "grade": "2",
          "team": "麗沢大学"
        },
        {
          "rank": 151,
          "time": "1:04:20",
          "name": "菅原匠人",
          "grade": "2",
          "team": "東京農業大学"
        },
        {
          "rank": 152,
          "time": "1:04:20",
          "name": "岩佐太陽",
          "grade": "1",
          "team": "明治大学"
        },
        {
          "rank": 153,
          "time": "1:04:23",
          "name": "井上史琉",
          "grade": "2",
          "team": "明治大学"
        },
        {
          "rank": 154,
          "time": "1:04:23",
          "name": "湯田陽平兵",
          "grade": "3",
          "team": "法政大学"
        },
        {
          "rank": 155,
          "time": "1:04:24",
          "name": "志村紘佑",
          "grade": "4",
          "team": "桜美林大学"
        },
        {
          "rank": 156,
          "time": "1:04:25",
          "name": "宮地大哉",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 157,
          "time": "1:04:26",
          "name": "佐藤祐介",
          "grade": "1",
          "team": "中央学院大学"
        },
        {
          "rank": 158,
          "time": "1:04:26",
          "name": "西中慈音",
          "grade": "4",
          "team": "平成国際大学"
        },
        {
          "rank": 159,
          "time": "1:04:26",
          "name": "増子岳",
          "grade": "1",
          "team": "大東文化大学"
        },
        {
          "rank": 160,
          "time": "1:04:27",
          "name": "田口涼太",
          "grade": "2",
          "team": "慶応義塾大学"
        },
        {
          "rank": 161,
          "time": "1:04:27",
          "name": "和田麻里",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 162,
          "time": "1:04:27",
          "name": "東泉大河",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 163,
          "time": "1:04:29",
          "name": "岡崎樹",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 164,
          "time": "1:04:29",
          "name": "鈴木愛音",
          "grade": "2",
          "team": "立教大学"
        },
        {
          "rank": 165,
          "time": "1:04:29",
          "name": "内田温規",
          "grade": "1",
          "team": "東京農業大学"
        },
        {
          "rank": 166,
          "time": "1:04:30",
          "name": "可児悠貴",
          "grade": "3",
          "team": "東海大学"
        },
        {
          "rank": 167,
          "time": "1:04:31",
          "name": "岩崎陽生",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 168,
          "time": "1:04:31",
          "name": "藤原幹大",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 169,
          "time": "1:04:31",
          "name": "植田航生",
          "grade": "3",
          "team": "芝浦工業大学"
        },
        {
          "rank": 170,
          "time": "1:04:31",
          "name": "平井翼",
          "grade": "3",
          "team": "山梨学院大学"
        },
        {
          "rank": 171,
          "time": "1:04:32",
          "name": "丹野暁翔",
          "grade": "3",
          "team": "芝浦工業大学"
        },
        {
          "rank": 172,
          "time": "1:04:32",
          "name": "水上流輝亜",
          "grade": "4",
          "team": "麗沢大学"
        },
        {
          "rank": 173,
          "time": "1:04:33",
          "name": "佐藤我駆人",
          "grade": "2",
          "team": "駿河台大学"
        },
        {
          "rank": 174,
          "time": "1:04:33",
          "name": "安達悠雅",
          "grade": "3",
          "team": "流通経済大学"
        },
        {
          "rank": 175,
          "time": "1:04:33",
          "name": "中野歩太",
          "grade": "1",
          "team": "明治学院大学"
        },
        {
          "rank": 176,
          "time": "1:04:35",
          "name": "荒原駿",
          "grade": "3",
          "team": "麗沢大学"
        },
        {
          "rank": 177,
          "time": "1:04:36",
          "name": "水津勇人",
          "grade": "1",
          "team": "日本体育大学"
        },
        {
          "rank": 178,
          "time": "1:04:36",
          "name": "大内亜彩希",
          "grade": "2",
          "team": "拓殖大学"
        },
        {
          "rank": 179,
          "time": "1:04:36",
          "name": "水崎隼",
          "grade": "4",
          "team": "亜細亜大学"
        },
        {
          "rank": 180,
          "time": "1:04:37",
          "name": "木村楓斗",
          "grade": "3",
          "team": "流通経済大学"
        },
        {
          "rank": 181,
          "time": "1:04:38",
          "name": "余村佑太朗",
          "grade": "3",
          "team": "筑波大学"
        },
        {
          "rank": 182,
          "time": "1:04:38",
          "name": "石井啓太",
          "grade": "3",
          "team": "順天堂大学"
        },
        {
          "rank": 183,
          "time": "1:04:38",
          "name": "中村優太",
          "grade": "2",
          "team": "筑波大学"
        },
        {
          "rank": 184,
          "time": "1:04:39",
          "name": "砂場育夢",
          "grade": "4",
          "team": "麗沢大学"
        },
        {
          "rank": 185,
          "time": "1:04:39",
          "name": "巽勇樹",
          "grade": "3",
          "team": "湘南工科大学"
        },
        {
          "rank": 186,
          "time": "1:04:39",
          "name": "小島光稀",
          "grade": "2",
          "team": "駿河台大学"
        },
        {
          "rank": 187,
          "time": "1:04:40",
          "name": "石堂壮真",
          "grade": "3",
          "team": "明治大学"
        },
        {
          "rank": 188,
          "time": "1:04:41",
          "name": "森山摩周",
          "grade": "4",
          "team": "国際武道大学"
        },
        {
          "rank": 189,
          "time": "1:04:41",
          "name": "竹林慧太",
          "grade": "4",
          "team": "関東学院大学"
        },
        {
          "rank": 190,
          "time": "1:04:42",
          "name": "鈴木将矢",
          "grade": "4",
          "team": "筑波大学"
        },
        {
          "rank": 191,
          "time": "1:04:42",
          "name": "江上天晴",
          "grade": "3",
          "team": "国士舘大学"
        },
        {
          "rank": 192,
          "time": "1:04:42",
          "name": "芳口慧人",
          "grade": "3",
          "team": "流通経済大学"
        },
        {
          "rank": 193,
          "time": "1:04:43",
          "name": "水戸瑛太",
          "grade": "2",
          "team": "芝浦工業大学"
        },
        {
          "rank": 194,
          "time": "1:04:43",
          "name": "日比野陸",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 195,
          "time": "1:04:43",
          "name": "岩瀬駿介",
          "grade": "1",
          "team": "芝浦工業大学"
        },
        {
          "rank": 196,
          "time": "1:04:45",
          "name": "会田昊生",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 197,
          "time": "1:04:45",
          "name": "中西慶士郎",
          "grade": "2",
          "team": "専修大学"
        },
        {
          "rank": 198,
          "time": "1:04:45",
          "name": "宮倉騎士",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 199,
          "time": "1:04:46",
          "name": "関本敬太",
          "grade": "4",
          "team": "上武大学"
        },
        {
          "rank": 200,
          "time": "1:04:47",
          "name": "山中寿世夢",
          "grade": "3",
          "team": "国士舘大学"
        },
        {
          "rank": 201,
          "time": "1:04:47",
          "name": "荒井秀太",
          "grade": "4",
          "team": "亜細亜大学"
        },
        {
          "rank": 202,
          "time": "1:04:47",
          "name": "保坂航平",
          "grade": "2",
          "team": "中央学院大学"
        },
        {
          "rank": 203,
          "time": "1:04:48",
          "name": "内田翔也",
          "grade": "4",
          "team": "東京経済大学"
        },
        {
          "rank": 204,
          "time": "1:04:48",
          "name": "藤井空大",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 205,
          "time": "1:04:48",
          "name": "二瓶知哉",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 206,
          "time": "1:04:49",
          "name": "松江耕輔",
          "grade": "3",
          "team": "東京農業大学"
        },
        {
          "rank": 207,
          "time": "1:04:49",
          "name": "曽根直也",
          "grade": "4",
          "team": "東京経済大学"
        },
        {
          "rank": 208,
          "time": "1:04:49",
          "name": "植月俊太",
          "grade": "3",
          "team": "東京農業大学"
        },
        {
          "rank": 209,
          "time": "1:04:51",
          "name": "高橋楓河",
          "grade": "2",
          "team": "山梨学院大学"
        },
        {
          "rank": 210,
          "time": "1:04:52",
          "name": "中野裕心",
          "grade": "2",
          "team": "拓殖大学"
        },
        {
          "rank": 211,
          "time": "1:04:53",
          "name": "菅野優空",
          "grade": "2",
          "team": "東京農業大学"
        },
        {
          "rank": 212,
          "time": "1:04:58",
          "name": "高須蓮",
          "grade": "2",
          "team": "国士舘大学"
        },
        {
          "rank": 213,
          "time": "1:04:59",
          "name": "室田安寿",
          "grade": "4",
          "team": "明治大学"
        },
        {
          "rank": 214,
          "time": "1:04:59",
          "name": "吉永歩",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 215,
          "time": "1:04:59",
          "name": "嶋田健人",
          "grade": "4",
          "team": "日本薬科大学"
        },
        {
          "rank": 216,
          "time": "1:05:00",
          "name": "高久浩輔",
          "grade": "2",
          "team": "筑波大学"
        },
        {
          "rank": 217,
          "time": "1:05:01",
          "name": "佐々木陸",
          "grade": "3",
          "team": "東京経済大学"
        },
        {
          "rank": 218,
          "time": "1:05:02",
          "name": "近藤蒼大",
          "grade": "3",
          "team": "日本薬科大学"
        },
        {
          "rank": 219,
          "time": "1:05:02",
          "name": "高木優輔",
          "grade": "4",
          "team": "桜美林大学"
        },
        {
          "rank": 220,
          "time": "1:05:02",
          "name": "佐上湘哉",
          "grade": "1",
          "team": "法政大学"
        },
        {
          "rank": 221,
          "time": "1:05:03",
          "name": "笠原雅敬",
          "grade": "3",
          "team": "育英大学"
        },
        {
          "rank": 222,
          "time": "1:05:04",
          "name": "伊藤聡平",
          "grade": "4",
          "team": "流通経済大学"
        },
        {
          "rank": 223,
          "time": "1:05:04",
          "name": "鍜治進之介",
          "grade": "2",
          "team": "亜細亜大学"
        },
        {
          "rank": 224,
          "time": "1:05:04",
          "name": "沖勘太郎",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 225,
          "time": "1:05:05",
          "name": "富永恭平",
          "grade": "4",
          "team": "桜美林大学"
        },
        {
          "rank": 226,
          "time": "1:05:06",
          "name": "大塚陸斗",
          "grade": "1",
          "team": "桜美林大学"
        },
        {
          "rank": 227,
          "time": "1:05:07",
          "name": "木村創",
          "grade": "1",
          "team": "麗沢大学"
        },
        {
          "rank": 228,
          "time": "1:05:08",
          "name": "和田晴之",
          "grade": "3",
          "team": "専修大学"
        },
        {
          "rank": 229,
          "time": "1:05:08",
          "name": "横田哲太",
          "grade": "4",
          "team": "亜細亜大学"
        },
        {
          "rank": 230,
          "time": "1:05:10",
          "name": "杉谷蒼天",
          "grade": "4",
          "team": "亜細亜大学"
        },
        {
          "rank": 231,
          "time": "1:05:11",
          "name": "長田拓巳",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 232,
          "time": "1:05:11",
          "name": "樋村銀河",
          "grade": "2",
          "team": "日本体育大学"
        },
        {
          "rank": 233,
          "time": "1:05:11",
          "name": "石渡翔",
          "grade": "1",
          "team": "流通経済大学"
        },
        {
          "rank": 234,
          "time": "1:05:12",
          "name": "佐々木敦弘",
          "grade": "3",
          "team": "関東学院大学"
        },
        {
          "rank": 235,
          "time": "1:05:14",
          "name": "今野柚輝",
          "grade": "2",
          "team": "上武大学"
        },
        {
          "rank": 236,
          "time": "1:05:16",
          "name": "平川瑠星",
          "grade": "3",
          "team": "神奈川大学"
        },
        {
          "rank": 237,
          "time": "1:05:16",
          "name": "佐野鈴太",
          "grade": "2",
          "team": "東海大学"
        },
        {
          "rank": 238,
          "time": "1:05:17",
          "name": "請井快星",
          "grade": "2",
          "team": "明治学院大学"
        },
        {
          "rank": 239,
          "time": "1:05:18",
          "name": "鈴木太陽",
          "grade": "4",
          "team": "慶応義塾大学"
        },
        {
          "rank": 240,
          "time": "1:05:19",
          "name": "坂上悠",
          "grade": "2",
          "team": "国士舘大学"
        },
        {
          "rank": 241,
          "time": "1:05:19",
          "name": "遠藤滉大",
          "grade": "4",
          "team": "東京経済大学"
        },
        {
          "rank": 242,
          "time": "1:05:20",
          "name": "小林圭吾",
          "grade": "2",
          "team": "芝浦工業大学"
        },
        {
          "rank": 243,
          "time": "1:05:21",
          "name": "菊地一輝",
          "grade": "4",
          "team": "明治学院大学"
        },
        {
          "rank": 244,
          "time": "1:05:21",
          "name": "稲木祐人",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 245,
          "time": "1:05:21",
          "name": "五十嵐葵",
          "grade": "1",
          "team": "明治学院大学"
        },
        {
          "rank": 246,
          "time": "1:05:23",
          "name": "佐藤亘",
          "grade": "4",
          "team": "桜美林大学"
        },
        {
          "rank": 247,
          "time": "1:05:25",
          "name": "東隆成",
          "grade": "1",
          "team": "亜細亜大学"
        },
        {
          "rank": 248,
          "time": "1:05:26",
          "name": "森尻悠翔",
          "grade": "1",
          "team": "芝浦工業大学"
        },
        {
          "rank": 249,
          "time": "1:05:26",
          "name": "川村飛翔",
          "grade": "2",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 250,
          "time": "1:05:27",
          "name": "堀口花道",
          "grade": "4",
          "team": "筑波大学"
        },
        {
          "rank": 251,
          "time": "1:05:27",
          "name": "兼松諒丞",
          "grade": "2",
          "team": "平成国際大学"
        },
        {
          "rank": 252,
          "time": "1:05:27",
          "name": "磯和琳",
          "grade": "3",
          "team": "関東学院大学"
        },
        {
          "rank": 253,
          "time": "1:05:27",
          "name": "桶田悠生",
          "grade": "1",
          "team": "明治大学"
        },
        {
          "rank": 254,
          "time": "1:05:27",
          "name": "今堀匡道",
          "grade": "2",
          "team": "国士舘大学"
        },
        {
          "rank": 255,
          "time": "1:05:27",
          "name": "本宮慶尚",
          "grade": "2",
          "team": "立教大学"
        },
        {
          "rank": 256,
          "time": "1:05:28",
          "name": "有川紘樹",
          "grade": "3",
          "team": "一橋大学"
        },
        {
          "rank": 257,
          "time": "1:05:29",
          "name": "三海渚",
          "grade": "3",
          "team": "桜美林大学"
        },
        {
          "rank": 258,
          "time": "1:05:29",
          "name": "平山櫂吏",
          "grade": "2",
          "team": "法政大学"
        },
        {
          "rank": 259,
          "time": "1:05:29",
          "name": "松井蒼真",
          "grade": "2",
          "team": "拓殖大学"
        },
        {
          "rank": 260,
          "time": "1:05:30",
          "name": "弓田一徹",
          "grade": "2",
          "team": "慶応義塾大学"
        },
        {
          "rank": 261,
          "time": "1:05:32",
          "name": "田辺真咲",
          "grade": "3",
          "team": "国士舘大学"
        },
        {
          "rank": 262,
          "time": "1:05:33",
          "name": "中尾晟皐",
          "grade": "3",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 263,
          "time": "1:05:35",
          "name": "小出暖人",
          "grade": "2",
          "team": "明治学院大学"
        },
        {
          "rank": 264,
          "time": "1:05:35",
          "name": "酒井忠久",
          "grade": "2",
          "team": "芝浦工業大学"
        },
        {
          "rank": 265,
          "time": "1:05:36",
          "name": "岡元快生",
          "grade": "2",
          "team": "国士舘大学"
        },
        {
          "rank": 266,
          "time": "1:05:37",
          "name": "川越成貴",
          "grade": "4",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 267,
          "time": "1:05:38",
          "name": "光岡和哉",
          "grade": "3",
          "team": "日本薬科大学"
        },
        {
          "rank": 268,
          "time": "1:05:38",
          "name": "瀧本吉輝",
          "grade": "2",
          "team": "平成国際大学"
        },
        {
          "rank": 269,
          "time": "1:05:38",
          "name": "中村光樹",
          "grade": "3",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 270,
          "time": "1:05:39",
          "name": "住谷歩",
          "grade": "4",
          "team": "明治学院大学"
        },
        {
          "rank": 271,
          "time": "1:05:41",
          "name": "鈴木天智",
          "grade": "4",
          "team": "東海大学"
        },
        {
          "rank": 272,
          "time": "1:05:42",
          "name": "大城拓海",
          "grade": "2",
          "team": "日本薬科大学"
        },
        {
          "rank": 273,
          "time": "1:05:43",
          "name": "添田大葵",
          "grade": "4",
          "team": "千葉大学"
        },
        {
          "rank": 274,
          "time": "1:05:45",
          "name": "磯光清",
          "grade": "3",
          "team": "東京農業大学"
        },
        {
          "rank": 275,
          "time": "1:05:47",
          "name": "高橋遼",
          "grade": "3",
          "team": "流通経済大学"
        },
        {
          "rank": 276,
          "time": "1:05:50",
          "name": "九嶋恵帆",
          "grade": "4",
          "team": "国士舘大学"
        },
        {
          "rank": 277,
          "time": "1:05:50",
          "name": "吉原生真",
          "grade": "2",
          "team": "流通経済大学"
        },
        {
          "rank": 278,
          "time": "1:05:50",
          "name": "湧川辰哉",
          "grade": "2",
          "team": "関東学院大学"
        },
        {
          "rank": 279,
          "time": "1:05:55",
          "name": "越智流輝",
          "grade": "2",
          "team": "育英大学"
        },
        {
          "rank": 280,
          "time": "1:05:55",
          "name": "水野龍吾",
          "grade": "4",
          "team": "国士舘大学"
        },
        {
          "rank": 281,
          "time": "1:05:57",
          "name": "茂木優斗",
          "grade": "2",
          "team": "上武大学"
        },
        {
          "rank": 282,
          "time": "1:05:58",
          "name": "小林慶太",
          "grade": "2",
          "team": "関東学院大学"
        },
        {
          "rank": 283,
          "time": "1:05:59",
          "name": "森川耀",
          "grade": "3",
          "team": "麗沢大学"
        },
        {
          "rank": 284,
          "time": "1:05:59",
          "name": "浮辺直人",
          "grade": "1",
          "team": "立教大学"
        },
        {
          "rank": 285,
          "time": "1:05:59",
          "name": "村上隼梧",
          "grade": "3",
          "team": "桜美林大学"
        },
        {
          "rank": 286,
          "time": "1:06:00",
          "name": "名和純希",
          "grade": "2",
          "team": "流通経済大学"
        },
        {
          "rank": 287,
          "time": "1:06:00",
          "name": "奈良慧弥",
          "grade": "4",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 288,
          "time": "1:06:00",
          "name": "庄司瑞輝",
          "grade": "3",
          "team": "大東文化大学"
        },
        {
          "rank": 289,
          "time": "1:06:01",
          "name": "千葉唯登",
          "grade": "4",
          "team": "育英大学"
        },
        {
          "rank": 290,
          "time": "1:06:03",
          "name": "佐野魁",
          "grade": "2",
          "team": "育英大学"
        },
        {
          "rank": 291,
          "time": "1:06:04",
          "name": "尾島樹",
          "grade": "2",
          "team": "上武大学"
        },
        {
          "rank": 292,
          "time": "1:06:05",
          "name": "天瀬海斗",
          "grade": "3",
          "team": "日本体育大学"
        },
        {
          "rank": 293,
          "time": "1:06:06",
          "name": "氷見亮太",
          "grade": "4",
          "team": "明治学院大学"
        },
        {
          "rank": 294,
          "time": "1:06:06",
          "name": "石井達也",
          "grade": "3",
          "team": "芝浦工業大学"
        },
        {
          "rank": 295,
          "time": "1:06:08",
          "name": "関口功太郎",
          "grade": "4",
          "team": "慶応義塾大学"
        },
        {
          "rank": 296,
          "time": "1:06:08",
          "name": "藁科健斗",
          "grade": "4",
          "team": "専修大学"
        },
        {
          "rank": 297,
          "time": "1:06:08",
          "name": "添田竜馬",
          "grade": "3",
          "team": "平成国際大学"
        },
        {
          "rank": 298,
          "time": "1:06:09",
          "name": "菊地奏多",
          "grade": "2",
          "team": "上武大学"
        },
        {
          "rank": 299,
          "time": "1:06:09",
          "name": "阿部健",
          "grade": "4",
          "team": "平成国際大学"
        },
        {
          "rank": 300,
          "time": "1:06:09",
          "name": "佐藤有季",
          "grade": "2",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 301,
          "time": "1:06:09",
          "name": "大塚蒼",
          "grade": "1",
          "team": "桜美林大学"
        },
        {
          "rank": 302,
          "time": "1:06:11",
          "name": "小森康太郎",
          "grade": "D3",
          "team": "東京大学大学院"
        },
        {
          "rank": 303,
          "time": "1:06:11",
          "name": "山本駿之介",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 304,
          "time": "1:06:12",
          "name": "東晃成",
          "grade": "4",
          "team": "麗沢大学"
        },
        {
          "rank": 305,
          "time": "1:06:12",
          "name": "宮川虎太朗",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 306,
          "time": "1:06:13",
          "name": "薄衣丞生",
          "grade": "1",
          "team": "桜美林大学"
        },
        {
          "rank": 307,
          "time": "1:06:13",
          "name": "石野日向",
          "grade": "2",
          "team": "慶応義塾大学"
        },
        {
          "rank": 308,
          "time": "1:06:14",
          "name": "鈴木海渡",
          "grade": "2",
          "team": "東京経済大学"
        },
        {
          "rank": 309,
          "time": "1:06:15",
          "name": "高橋重陽",
          "grade": "4",
          "team": "平成国際大学"
        },
        {
          "rank": 310,
          "time": "1:06:16",
          "name": "春山祐輔",
          "grade": "3",
          "team": "関東学院大学"
        },
        {
          "rank": 311,
          "time": "1:06:16",
          "name": "榎本蒼空",
          "grade": "3",
          "team": "国士舘大学"
        },
        {
          "rank": 312,
          "time": "1:06:18",
          "name": "神之田大翼",
          "grade": "4",
          "team": "麗沢大学"
        },
        {
          "rank": 313,
          "time": "1:06:18",
          "name": "知念優斗",
          "grade": "2",
          "team": "立正大学"
        },
        {
          "rank": 314,
          "time": "1:06:19",
          "name": "小沢真乃亮",
          "grade": "1",
          "team": "東京経済大学"
        },
        {
          "rank": 315,
          "time": "1:06:19",
          "name": "安濃寛人",
          "grade": "4",
          "team": "亜細亜大学"
        },
        {
          "rank": 316,
          "time": "1:06:19",
          "name": "熊谷哲平",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 317,
          "time": "1:06:23",
          "name": "芦野清志郎",
          "grade": "3",
          "team": "慶応義塾大学"
        },
        {
          "rank": 318,
          "time": "1:06:27",
          "name": "坂本翔喜",
          "grade": "2",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 319,
          "time": "1:06:27",
          "name": "熊谷颯柊",
          "grade": "1",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 320,
          "time": "1:06:28",
          "name": "石堂留偉",
          "grade": "3",
          "team": "育英大学"
        },
        {
          "rank": 321,
          "time": "1:06:29",
          "name": "徳田愛斗",
          "grade": "2",
          "team": "拓殖大学"
        },
        {
          "rank": 322,
          "time": "1:06:30",
          "name": "森田凌成",
          "grade": "1",
          "team": "亜細亜大学"
        },
        {
          "rank": 323,
          "time": "1:06:31",
          "name": "谷田琥太郎",
          "grade": "1",
          "team": "亜細亜大学"
        },
        {
          "rank": 324,
          "time": "1:06:33",
          "name": "荻原悠生",
          "grade": "2",
          "team": "筑波大学"
        },
        {
          "rank": 325,
          "time": "1:06:35",
          "name": "永田覇人",
          "grade": "3",
          "team": "芝浦工業大学"
        },
        {
          "rank": 326,
          "time": "1:06:36",
          "name": "宮本錬",
          "grade": "2",
          "team": "清和大学"
        },
        {
          "rank": 327,
          "time": "1:06:36",
          "name": "宇都宮光希",
          "grade": "2",
          "team": "立正大学"
        },
        {
          "rank": 328,
          "time": "1:06:36",
          "name": "森谷翔",
          "grade": "3",
          "team": "防衛大学校"
        },
        {
          "rank": 329,
          "time": "1:06:37",
          "name": "佐藤青葉",
          "grade": "4",
          "team": "湘南工科大学"
        },
        {
          "rank": 330,
          "time": "1:06:37",
          "name": "関野大空",
          "grade": "2",
          "team": "明治学院大学"
        },
        {
          "rank": 331,
          "time": "1:06:38",
          "name": "沢田薫",
          "grade": "2",
          "team": "慶応義塾大学"
        },
        {
          "rank": 332,
          "time": "1:06:39",
          "name": "黒川拓海",
          "grade": "4",
          "team": "駿河台大学"
        },
        {
          "rank": 333,
          "time": "1:06:41",
          "name": "高橋拓海",
          "grade": "4",
          "team": "桜美林大学"
        },
        {
          "rank": 334,
          "time": "1:06:43",
          "name": "田丸颯馬",
          "grade": "2",
          "team": "立教大学"
        },
        {
          "rank": 335,
          "time": "1:06:44",
          "name": "土赤本気",
          "grade": "4",
          "team": "平成国際大学"
        },
        {
          "rank": 336,
          "time": "1:06:44",
          "name": "仙田宇宙",
          "grade": "4",
          "team": "国際武道大学"
        },
        {
          "rank": 337,
          "time": "1:06:45",
          "name": "渋谷大和",
          "grade": "2",
          "team": "東京経済大学"
        },
        {
          "rank": 338,
          "time": "1:06:47",
          "name": "東田大輝",
          "grade": "2",
          "team": "亜細亜大学"
        },
        {
          "rank": 339,
          "time": "1:06:49",
          "name": "佐藤達平",
          "grade": "2",
          "team": "平成国際大学"
        },
        {
          "rank": 340,
          "time": "1:06:49",
          "name": "笠井心翔",
          "grade": "2",
          "team": "麗沢大学"
        },
        {
          "rank": 341,
          "time": "1:06:50",
          "name": "山本昂輝",
          "grade": "1",
          "team": "明治学院大学"
        },
        {
          "rank": 342,
          "time": "1:06:50",
          "name": "小林潤弥",
          "grade": "4",
          "team": "立正大学"
        },
        {
          "rank": 343,
          "time": "1:06:51",
          "name": "伊藤光輝",
          "grade": "3",
          "team": "桜美林大学"
        },
        {
          "rank": 344,
          "time": "1:06:53",
          "name": "浜口誠太",
          "grade": "3",
          "team": "関東学院大学"
        },
        {
          "rank": 345,
          "time": "1:06:53",
          "name": "谷口海音",
          "grade": "1",
          "team": "麗沢大学"
        },
        {
          "rank": 346,
          "time": "1:06:54",
          "name": "木村駿斗",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 347,
          "time": "1:06:54",
          "name": "村松丈",
          "grade": "4",
          "team": "東京経済大学"
        },
        {
          "rank": 348,
          "time": "1:06:55",
          "name": "酒上晃太朗",
          "grade": "3",
          "team": "育英大学"
        },
        {
          "rank": 349,
          "time": "1:06:56",
          "name": "樋熊悠翔",
          "grade": "3",
          "team": "埼玉大学"
        },
        {
          "rank": 350,
          "time": "1:06:58",
          "name": "村上晏璃",
          "grade": "3",
          "team": "清和大学"
        },
        {
          "rank": 351,
          "time": "1:07:00",
          "name": "森祥真",
          "grade": "4",
          "team": "東京大学"
        },
        {
          "rank": 352,
          "time": "1:07:01",
          "name": "山崎開地",
          "grade": "2",
          "team": "東京経済大学"
        },
        {
          "rank": 353,
          "time": "1:07:06",
          "name": "中村翔吾",
          "grade": "3",
          "team": "育英大学"
        },
        {
          "rank": 354,
          "time": "1:07:07",
          "name": "高田真朋",
          "grade": "3",
          "team": "日本大学"
        },
        {
          "rank": 355,
          "time": "1:07:10",
          "name": "山口凛",
          "grade": "4",
          "team": "立正大学"
        },
        {
          "rank": 356,
          "time": "1:07:19",
          "name": "福島孝介",
          "grade": "3",
          "team": "国際武道大学"
        },
        {
          "rank": 357,
          "time": "1:07:23",
          "name": "馬渡光聖",
          "grade": "3",
          "team": "関東学院大学"
        },
        {
          "rank": 358,
          "time": "1:07:25",
          "name": "大原爽生",
          "grade": "2",
          "team": "日本薬科大学"
        },
        {
          "rank": 359,
          "time": "1:07:25",
          "name": "大島希",
          "grade": "3",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 360,
          "time": "1:07:28",
          "name": "中里温明",
          "grade": "1",
          "team": "東京経済大学"
        },
        {
          "rank": 361,
          "time": "1:07:28",
          "name": "片野滉介",
          "grade": "1",
          "team": "関東学院大学"
        },
        {
          "rank": 362,
          "time": "1:07:31",
          "name": "丸子晴樹",
          "grade": "4",
          "team": "筑波大学"
        },
        {
          "rank": 363,
          "time": "1:07:32",
          "name": "浅見咲哉",
          "grade": "3",
          "team": "東京理科大学"
        },
        {
          "rank": 364,
          "time": "1:07:33",
          "name": "川端樹",
          "grade": "1",
          "team": "育英大学"
        },
        {
          "rank": 365,
          "time": "1:07:37",
          "name": "鎗田光希",
          "grade": "4",
          "team": "拓殖大学"
        },
        {
          "rank": 366,
          "time": "1:07:40",
          "name": "渡辺義仁",
          "grade": "1",
          "team": "芝浦工業大学"
        },
        {
          "rank": 367,
          "time": "1:07:43",
          "name": "西川結人",
          "grade": "3",
          "team": "流通経済大学"
        },
        {
          "rank": 368,
          "time": "1:07:48",
          "name": "遠藤楽士",
          "grade": "3",
          "team": "亜細亜大学"
        },
        {
          "rank": 369,
          "time": "1:07:50",
          "name": "大宮夏輝",
          "grade": "2",
          "team": "東京大学"
        },
        {
          "rank": 370,
          "time": "1:07:51",
          "name": "小山陽生",
          "grade": "3",
          "team": "筑波大学"
        },
        {
          "rank": 371,
          "time": "1:07:52",
          "name": "杉原立樹",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 372,
          "time": "1:07:53",
          "name": "荒井一翔",
          "grade": "2",
          "team": "流通経済大学"
        },
        {
          "rank": 373,
          "time": "1:07:54",
          "name": "木野剣芯",
          "grade": "1",
          "team": "湘南工科大学"
        },
        {
          "rank": 374,
          "time": "1:07:55",
          "name": "沢口夢大",
          "grade": "1",
          "team": "平成国際大学"
        },
        {
          "rank": 375,
          "time": "1:07:57",
          "name": "越川剛暉",
          "grade": "M1",
          "team": "東京大学大学院"
        },
        {
          "rank": 376,
          "time": "1:07:57",
          "name": "金丸蒼",
          "grade": "5",
          "team": "慶応義塾大学"
        },
        {
          "rank": 377,
          "time": "1:07:58",
          "name": "津金海斗",
          "grade": "1",
          "team": "立正大学"
        },
        {
          "rank": 378,
          "time": "1:08:06",
          "name": "森啓志朗",
          "grade": "3",
          "team": "武蔵野学院大学"
        },
        {
          "rank": 379,
          "time": "1:08:08",
          "name": "西田大晟",
          "grade": "M1",
          "team": "東京大学大学院"
        },
        {
          "rank": 380,
          "time": "1:08:09",
          "name": "牧野龍哉",
          "grade": "2",
          "team": "育英大学"
        },
        {
          "rank": 381,
          "time": "1:08:10",
          "name": "榊原巧",
          "grade": "4",
          "team": "麗沢大学"
        },
        {
          "rank": 382,
          "time": "1:08:11",
          "name": "石川大雅",
          "grade": "1",
          "team": "国際武道大学"
        },
        {
          "rank": 383,
          "time": "1:08:15",
          "name": "福世翔哉",
          "grade": "4",
          "team": "東京経済大学"
        },
        {
          "rank": 384,
          "time": "1:08:15",
          "name": "五十嵐隼人",
          "grade": "1",
          "team": "関東学院大学"
        },
        {
          "rank": 385,
          "time": "1:08:17",
          "name": "東叶夢",
          "grade": "4",
          "team": "慶応義塾大学"
        },
        {
          "rank": 386,
          "time": "1:08:17",
          "name": "仲川拓駈",
          "grade": "2",
          "team": "清和大学"
        },
        {
          "rank": 387,
          "time": "1:08:22",
          "name": "今里嘉伸",
          "grade": "3",
          "team": "国際武道大学"
        },
        {
          "rank": 388,
          "time": "1:08:23",
          "name": "中山輝",
          "grade": "4",
          "team": "東京理科大学"
        },
        {
          "rank": 389,
          "time": "1:08:24",
          "name": "迎里慈詠",
          "grade": "2",
          "team": "国際武道大学"
        },
        {
          "rank": 390,
          "time": "1:08:26",
          "name": "野崎佑太",
          "grade": "4",
          "team": "東京理科大学"
        },
        {
          "rank": 391,
          "time": "1:08:30",
          "name": "金元智哉",
          "grade": "3",
          "team": "立正大学"
        },
        {
          "rank": 392,
          "time": "1:08:34",
          "name": "藤枝蓮音",
          "grade": "1",
          "team": "関東学院大学"
        },
        {
          "rank": 393,
          "time": "1:08:40",
          "name": "永瀬結貴",
          "grade": "2",
          "team": "育英大学"
        },
        {
          "rank": 394,
          "time": "1:08:43",
          "name": "辻爽良",
          "grade": "2",
          "team": "防衛大学校"
        },
        {
          "rank": 395,
          "time": "1:08:43",
          "name": "川村駿斗",
          "grade": "2",
          "team": "千葉大学"
        },
        {
          "rank": 396,
          "time": "1:08:44",
          "name": "高田雄河",
          "grade": "1",
          "team": "立正大学"
        },
        {
          "rank": 397,
          "time": "1:08:53",
          "name": "川口直央",
          "grade": "3",
          "team": "平成国際大学"
        },
        {
          "rank": 398,
          "time": "1:08:55",
          "name": "高橋拓未",
          "grade": "M2",
          "team": "東京大学大学院"
        },
        {
          "rank": 399,
          "time": "1:08:56",
          "name": "武市颯太",
          "grade": "1",
          "team": "流通経済大学"
        },
        {
          "rank": 400,
          "time": "1:08:58",
          "name": "足立華紀",
          "grade": "4",
          "team": "立正大学"
        },
        {
          "rank": 401,
          "time": "1:08:58",
          "name": "横山成",
          "grade": "3",
          "team": "清和大学"
        },
        {
          "rank": 402,
          "time": "1:09:01",
          "name": "三輪光琉",
          "grade": "3",
          "team": "清和大学"
        },
        {
          "rank": 403,
          "time": "1:09:03",
          "name": "浜崎航太郎",
          "grade": "M3",
          "team": "東京大学大学院"
        },
        {
          "rank": 404,
          "time": "1:09:03",
          "name": "井島真遥",
          "grade": "3",
          "team": "上武大学"
        },
        {
          "rank": 405,
          "time": "1:09:04",
          "name": "松本爽汰",
          "grade": "2",
          "team": "関東学院大学"
        },
        {
          "rank": 406,
          "time": "1:09:14",
          "name": "高橋光稀",
          "grade": "3",
          "team": "国際武道大学"
        },
        {
          "rank": 407,
          "time": "1:09:17",
          "name": "瀬川莉玖",
          "grade": "M1",
          "team": "東京大学大学院"
        },
        {
          "rank": 408,
          "time": "1:09:22",
          "name": "渡辺亮斗",
          "grade": "3",
          "team": "育英大学"
        },
        {
          "rank": 409,
          "time": "1:09:26",
          "name": "神守正義",
          "grade": "3",
          "team": "国際武道大学"
        },
        {
          "rank": 410,
          "time": "1:09:28",
          "name": "井川大我",
          "grade": "3",
          "team": "防衛大学校"
        },
        {
          "rank": 411,
          "time": "1:09:31",
          "name": "越野レオ",
          "grade": "M1",
          "team": "東京大学大学院"
        },
        {
          "rank": 412,
          "time": "1:09:34",
          "name": "小海颯太",
          "grade": "2",
          "team": "育英大学"
        },
        {
          "rank": 413,
          "time": "1:09:34",
          "name": "染川尊俊",
          "grade": "1",
          "team": "東京大学"
        },
        {
          "rank": 414,
          "time": "1:09:45",
          "name": "笠井天斗",
          "grade": "3",
          "team": "国際武道大学"
        },
        {
          "rank": 415,
          "time": "1:09:45",
          "name": "斎藤雄一郎",
          "grade": "1",
          "team": "清和大学"
        },
        {
          "rank": 416,
          "time": "1:09:57",
          "name": "渡辺諒",
          "grade": "4",
          "team": "慶応義塾大学"
        },
        {
          "rank": 417,
          "time": "1:10:04",
          "name": "島田亘",
          "grade": "4",
          "team": "慶応義塾大学"
        },
        {
          "rank": 418,
          "time": "1:10:18",
          "name": "和多希巳",
          "grade": "1",
          "team": "立正大学"
        },
        {
          "rank": 419,
          "time": "1:10:20",
          "name": "小泉天空",
          "grade": "2",
          "team": "東京理科大学"
        },
        {
          "rank": 420,
          "time": "1:10:23",
          "name": "中根美七海",
          "grade": "D1",
          "team": "東京大学大学院"
        },
        {
          "rank": 421,
          "time": "1:10:28",
          "name": "山内彬徳",
          "grade": "3",
          "team": "千葉大学"
        },
        {
          "rank": 422,
          "time": "1:10:29",
          "name": "小西諒",
          "grade": "M1",
          "team": "東京大学大学院"
        },
        {
          "rank": 423,
          "time": "1:10:30",
          "name": "大城琉生",
          "grade": "2",
          "team": "国際武道大学"
        },
        {
          "rank": 424,
          "time": "1:10:31",
          "name": "落合尊翔",
          "grade": "2",
          "team": "立正大学"
        },
        {
          "rank": 425,
          "time": "1:10:36",
          "name": "小堺隆弘",
          "grade": "4",
          "team": "一橋大学"
        },
        {
          "rank": 426,
          "time": "1:10:42",
          "name": "村屋伶音",
          "grade": "2",
          "team": "国際武道大学"
        },
        {
          "rank": 427,
          "time": "1:10:47",
          "name": "鈴木晴陽",
          "grade": "1",
          "team": "東京大学"
        },
        {
          "rank": 428,
          "time": "1:10:48",
          "name": "今村愁",
          "grade": "4",
          "team": "日本薬科大学"
        },
        {
          "rank": 429,
          "time": "1:10:52",
          "name": "竹村勇輝",
          "grade": "2",
          "team": "湘南工科大学"
        },
        {
          "rank": 430,
          "time": "1:10:55",
          "name": "渋谷優斗",
          "grade": "3",
          "team": "埼玉大学"
        },
        {
          "rank": 431,
          "time": "1:11:04",
          "name": "早川佳津摩",
          "grade": "2",
          "team": "清和大学"
        },
        {
          "rank": 432,
          "time": "1:11:06",
          "name": "辻大翔",
          "grade": "3",
          "team": "東京理科大学"
        },
        {
          "rank": 433,
          "time": "1:11:19",
          "name": "藤井心太朗",
          "grade": "M1",
          "team": "東京大学大学院"
        },
        {
          "rank": 434,
          "time": "1:11:19",
          "name": "石田泰誠",
          "grade": "3",
          "team": "千葉大学"
        },
        {
          "rank": 435,
          "time": "1:11:21",
          "name": "杉山翔梧",
          "grade": "2",
          "team": "湘南工科大学"
        },
        {
          "rank": 436,
          "time": "1:11:23",
          "name": "脇陽真",
          "grade": "3",
          "team": "湘南工科大学"
        },
        {
          "rank": 437,
          "time": "1:11:29",
          "name": "久保田興輝",
          "grade": "2",
          "team": "防衛大学校"
        },
        {
          "rank": 438,
          "time": "1:11:34",
          "name": "宮池真吾",
          "grade": "2",
          "team": "千葉大学"
        },
        {
          "rank": 439,
          "time": "1:11:36",
          "name": "梶岡拓真",
          "grade": "3",
          "team": "一橋大学"
        },
        {
          "rank": 440,
          "time": "1:11:37",
          "name": "南風盛蔵丸",
          "grade": "3",
          "team": "防衛大学校"
        },
        {
          "rank": 441,
          "time": "1:11:45",
          "name": "木下拳志",
          "grade": "1",
          "team": "東京理科大学"
        },
        {
          "rank": 442,
          "time": "1:11:48",
          "name": "津端直人",
          "grade": "2",
          "team": "一橋大学"
        },
        {
          "rank": 443,
          "time": "1:11:56",
          "name": "金指彰",
          "grade": "4",
          "team": "千葉大学"
        },
        {
          "rank": 444,
          "time": "1:11:58",
          "name": "浅野拓人",
          "grade": "4",
          "team": "清和大学"
        },
        {
          "rank": 445,
          "time": "1:12:02",
          "name": "儘田蓮冬",
          "grade": "3",
          "team": "千葉大学"
        },
        {
          "rank": 446,
          "time": "1:12:04",
          "name": "陶山丈太朗",
          "grade": "2",
          "team": "湘南工科大学"
        },
        {
          "rank": 447,
          "time": "1:12:05",
          "name": "沼田海翔",
          "grade": "2",
          "team": "清和大学"
        },
        {
          "rank": 448,
          "time": "1:12:06",
          "name": "柳沼大輝",
          "grade": "4",
          "team": "東京大学"
        },
        {
          "rank": 449,
          "time": "1:12:07",
          "name": "田川数馬",
          "grade": "3",
          "team": "東京理科大学"
        },
        {
          "rank": 450,
          "time": "1:12:11",
          "name": "山本陽",
          "grade": "3",
          "team": "埼玉大学"
        },
        {
          "rank": 451,
          "time": "1:12:13",
          "name": "伊藤礼哉",
          "grade": "3",
          "team": "清和大学"
        },
        {
          "rank": 452,
          "time": "1:12:21",
          "name": "竹内紀翔",
          "grade": "1",
          "team": "東京理科大学"
        },
        {
          "rank": 453,
          "time": "1:12:24",
          "name": "風早亮太",
          "grade": "2",
          "team": "湘南工科大学"
        },
        {
          "rank": 454,
          "time": "1:12:32",
          "name": "高木啓陽",
          "grade": "2",
          "team": "東京大学"
        },
        {
          "rank": 455,
          "time": "1:12:33",
          "name": "竹前星汰",
          "grade": "4",
          "team": "湘南工科大学"
        },
        {
          "rank": 456,
          "time": "1:12:34",
          "name": "新村芽久",
          "grade": "1",
          "team": "埼玉大学"
        },
        {
          "rank": 457,
          "time": "1:12:37",
          "name": "小泉祐翔",
          "grade": "1",
          "team": "東京大学"
        },
        {
          "rank": 458,
          "time": "1:12:38",
          "name": "海野瑛良",
          "grade": "2",
          "team": "東京経済大学"
        },
        {
          "rank": 459,
          "time": "1:12:44",
          "name": "瀧沢奏太",
          "grade": "4",
          "team": "東京理科大学"
        },
        {
          "rank": 460,
          "time": "1:12:55",
          "name": "中元洸",
          "grade": "4",
          "team": "一橋大学"
        },
        {
          "rank": 461,
          "time": "1:12:59",
          "name": "大泉亮太",
          "grade": "1",
          "team": "一橋大学"
        },
        {
          "rank": 462,
          "time": "1:13:17",
          "name": "小平泰地",
          "grade": "4",
          "team": "千葉大学"
        },
        {
          "rank": 463,
          "time": "1:13:20",
          "name": "高野翔主希",
          "grade": "3",
          "team": "湘南工科大学"
        },
        {
          "rank": 464,
          "time": "1:13:29",
          "name": "磯部陽翔",
          "grade": "2",
          "team": "一橋大学"
        },
        {
          "rank": 465,
          "time": "1:13:30",
          "name": "瀬ノ田赳斗",
          "grade": "4",
          "team": "清和大学"
        },
        {
          "rank": 466,
          "time": "1:13:44",
          "name": "東条秀祐",
          "grade": "M2",
          "team": "東京大学大学院"
        },
        {
          "rank": 467,
          "time": "1:13:47",
          "name": "大渡陸斗",
          "grade": "4",
          "team": "国際武道大学"
        },
        {
          "rank": 468,
          "time": "1:13:51",
          "name": "田中風舞",
          "grade": "3",
          "team": "東京大学"
        },
        {
          "rank": 469,
          "time": "1:13:53",
          "name": "原賀諒",
          "grade": "2",
          "team": "清和大学"
        },
        {
          "rank": 470,
          "time": "1:14:00",
          "name": "西元大悟",
          "grade": "3",
          "team": "埼玉大学"
        },
        {
          "rank": 471,
          "time": "1:14:04",
          "name": "後藤隆志",
          "grade": "4",
          "team": "一橋大学"
        },
        {
          "rank": 472,
          "time": "1:14:12",
          "name": "下野大輔",
          "grade": "2",
          "team": "埼玉大学"
        },
        {
          "rank": 473,
          "time": "1:14:14",
          "name": "水谷峻太朗",
          "grade": "1",
          "team": "千葉大学"
        },
        {
          "rank": 474,
          "time": "1:14:18",
          "name": "目黒蒼弥",
          "grade": "1",
          "team": "一橋大学"
        },
        {
          "rank": 475,
          "time": "1:14:20",
          "name": "小出浩斗",
          "grade": "3",
          "team": "千葉大学"
        },
        {
          "rank": 476,
          "time": "1:14:20",
          "name": "保坂拓久斗",
          "grade": "3",
          "team": "東京理科大学"
        },
        {
          "rank": 477,
          "time": "1:14:28",
          "name": "大沢直紀",
          "grade": "3",
          "team": "埼玉大学"
        },
        {
          "rank": 478,
          "time": "1:14:29",
          "name": "小沢直紘",
          "grade": "1",
          "team": "東京大学"
        },
        {
          "rank": 479,
          "time": "1:14:41",
          "name": "内田直希",
          "grade": "4",
          "team": "埼玉大学"
        },
        {
          "rank": 480,
          "time": "1:14:46",
          "name": "広田亘成",
          "grade": "3",
          "team": "防衛大学校"
        },
        {
          "rank": 481,
          "time": "1:14:47",
          "name": "原修平",
          "grade": "1",
          "team": "東京理科大学"
        },
        {
          "rank": 482,
          "time": "1:14:56",
          "name": "木村凛太朗",
          "grade": "3",
          "team": "一橋大学"
        },
        {
          "rank": 483,
          "time": "1:15:01",
          "name": "大槻修也",
          "grade": "2",
          "team": "東京大学"
        },
        {
          "rank": 484,
          "time": "1:15:22",
          "name": "礒野光",
          "grade": "1",
          "team": "埼玉大学"
        },
        {
          "rank": 485,
          "time": "1:15:23",
          "name": "鈴木千尋",
          "grade": "1",
          "team": "明治学院大学"
        },
        {
          "rank": 486,
          "time": "1:15:25",
          "name": "望月皓平",
          "grade": "5",
          "team": "東京大学"
        },
        {
          "rank": 487,
          "time": "1:15:30",
          "name": "奥田陽喜",
          "grade": "2",
          "team": "東京理科大学"
        },
        {
          "rank": 488,
          "time": "1:15:38",
          "name": "岩野祥大",
          "grade": "3",
          "team": "千葉大学"
        },
        {
          "rank": 489,
          "time": "1:15:53",
          "name": "都留明彦",
          "grade": "3",
          "team": "防衛大学校"
        },
        {
          "rank": 490,
          "time": "1:16:35",
          "name": "吉田陸人",
          "grade": "2",
          "team": "一橋大学"
        },
        {
          "rank": 491,
          "time": "1:16:43",
          "name": "小阪壮平",
          "grade": "3",
          "team": "一橋大学"
        },
        {
          "rank": 492,
          "time": "1:17:04",
          "name": "田村煌希",
          "grade": "1",
          "team": "埼玉大学"
        },
        {
          "rank": 493,
          "time": "1:19:20",
          "name": "土谷飛羽",
          "grade": "4",
          "team": "埼玉大学"
        },
        {
          "rank": 494,
          "time": "1:20:16",
          "name": "楊井暖",
          "grade": "4",
          "team": "千葉大学"
        },
        {
          "rank": 495,
          "time": "1:22:16",
          "name": "松下竜大",
          "grade": "3",
          "team": "防衛大学校"
        }
      ],
      "source": "https://genkimanman.com/halfmarathon/hakoneyosen/hakoneyosen2025.html"
    }
  }
};
